<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>ชีวิตดิจิตอลของคุณแตกออกเป็นเสี่ยงๆ ไหม?</h2>

<p>หากคุณรู้อยู่แล้วว่าการแตกออกเป็นเสี่ยงๆ (fragmentation) หมายถึงอะไร และยังจำเป็นต้องทำการจัดเรียงข้อมูล (defragmentation) บนดิสก์ของคุณอยู่ทุกๆ เดือนแล้ว นี่คือถ้อยคำสั้นแต่ได้ใจความ : ลินุกซ์ไม่ต้องการการจัดเรียงข้อมูลใหม่</p>

<p>มาลองจิตนาการถึงฮาร์ดดิสก์ของคุณที่เป็นตู้เอกสารขนาดมหึมา มีลิ้นชักอยู่เป็นล้านๆ ช่อง (ขอแสดงความขอบคุณอย่างลึกซึ้งไปยัง <a href="http://www.pps.jussieu.fr/~dicosmo/">โรเบอร์โต้ ดิ คอสโม</a>) สำหรับการเปรียบเทียบอันใหญ่หลวงครั้งนี้) แต่ละลิ้นชักสามารถเก็บข้อมูลได้จำกัด ดังนั้นหากเอกสารมีขนาดใหญ่กว่าที่ลิ้นชักอันหนึ่งจะเก็บไว้ได้ ก็จำเป็นที่จะต้องถูกหั่นแยกชิ้น บางเอกสารอาจจะใหญ่กินพื้นที่หลายพันลิ้นชัก และแน่นอนการเข้าถึงลิ้นชักที่เก็บเอกสารเหล่านี้ง่ายมากหากลิ้นชักมันอยู่ใกล้ชิดติดกันบนตู้เอกสารขนาดมหึมา</p>

<p>ลองจิตนาการดูกันต่อว่า คุณเป็นเจ้าของตู้เอกสารนี้ แต่คุณไม่มีเวลาจะมาใส่ใจมันมากนัก และคุณต้องการจ้างใครซักคนมาจัดการแทน มีสองคนยินดีพร้อมรับงานชิ้นนี้ หนึ่งเป็นสตรีเพศ อีกหนึ่งคือบุรุษชาติอาชาไนย</p>

<ul>

<li>กระทาชายไม่ปรากฎนามมาพร้อมด้วยกลยุทธ์สุดกู่ : เขาจะเคลียร์ทุกๆ ลิ้นชักเมื่อมีเอกสารถูกย้ายออกไป สำหรับเอกสารใหม่ที่เข้ามาจะถูกแบ่งซอยเป็นส่วนๆ พอดีกับลิ้นชัก และสุ่มเก็บแต่ละชิ้นลงไปที่ลิ้นชักว่างอันแรกสุดที่เจอ (เข้าทำนองมักง่าย) เมื่อคุณถามเขาว่ามันจะยากไหมตอนจะควานหาทุกชิ้นส่วนกลับออกมารวมกันเป็นหนึ่งเอกสาร เขาตอบทันทีมิมีลังเลว่า เราจะต้องจ้างเด็กน้อยมาอีกหนึ่งโหลในแต่ละสุดสัปดาห์เพื่อมาจัดเรียงลิ้นชักให้เป็นระเบียบเรียบร้อย</li>

<li>กลับมาที่คู่ต่อกร โฉมสะคราญผู้งามหมดจดจรดทั้งสามโลก หล่อนมาด้วยเทคนิคอันแตกต่าง : เจ้าหล่อนบันทึกบนกระดาษใบน้อยไว้ว่าลิ้นชักใดบ้างที่ว่างติดกันเป็นแถบ เมื่อมีเอกสารใหม่เข้ามา หล่อนค้นหาจากรายการที่เก็บไว้ว่ามีลิ้นชักไหนว่างชิดเรียงติดกันเพียงพอที่จะเก็บเอกสารนั้นไว้ด้วยกันบ้าง และนั่นคือที่อยู่ของเอกสารที่เข้ามาใหม่ ตามแนวทางอันบรรเจิดนี้ย่อมต้องเป็นการดีต่อการทำงาน และตู้เอกสารก็กลับกลายเป็นตู้ที่มีระเบียบเรียบร้อยสืบแต่นั้นมา</li>

</ul>

<p>ไร้ซึ่งข้อกังขา คุณควรจะจ้างสตรีผู้นั้น (คุณก็ควรจะรู้ไว้ด้วยว่าผู้หญิงมักจัดการอะไรต่อมิอะไรได้ดีเสมอ).... มาถึงเรื่องของเรา วินโดวส์เลือกใช้วิธีการแรก ลินุกซ์เลือกวิธีการหลัง ยิ่งคุณทำงานบนวินโดวส์มากเท่าไร การเข้าถึงไฟล์ก็จะช้าลง ช้าลงเรื่อยๆ ยิ่งคุณทำงานบนลินุกซ์มากเท่าไร ความเร็วก็ยิ่งทับทวี ทางเลือกเป็นของคุณแล้ว!</p>

<img src="Images/defragment.png" />

</div>
</body>
</html>
