
<div id="corps">

<h2>ลอง "ซีดีสด-Live CD"</h2>

<p>คุณสามารถลองใช้งานลินุกซ์โดยไม่ยุ่งเกี่ยวกับฮาร์ดดิสก์ของคุณ และไม่ต้องไปแตะต้องวินโดวส์ของคุณแม้แต่ปลายเล็บ!</p>

<p>สิ่งเหล่านี้เกิดขึ้นได้ด้วย "ลินุกซ์ซีดีสด" มันทำงานอย่างนี้เลย</p>

<ul>

<li>ดาวน์โหลดอิมเมจจากเว็บ (ไฟล์นามสกุล <tt>.iso</tt> ขนาดประมาณ 650 MB)</li>

<li>เขียนมันลงแผ่นซีดีซะ</li>

<li>ใส่แผ่นลงไดร์ฟแล้วรีบู๊ต</li>

<li>เครื่องของคุณควรจะบู๊ตจากแผ่นหาใช่ฮาร์ดดิสก์ (ที่มีวินโดวส์อยู่) ไม่ และจะ <b>ไม่ยุ่งเกี่ยวใดๆ</b> กับฮาร์ดดิสก์ของคุณ ไม่ต้องเป็นกังวลกับวินโดวส์กับข้อมูลของคุณ มันจะปลอดภัยดี และกลับมาอีกครั้งหากคุณบู๊ตตรงๆ โดยไม่ใส่ซีดี</li>

<li>หากเครื่องของคุณยังคงบู๊ตเข้าวินโดวส์แล้วไซร้ (ซีดีไม่ได้สะดุ้งสะเทือนใดๆ) คุณจำเป็นต้องไปไล่เช็คไบออสแล้วล่ะ คุณต้องบอกเครื่องคุณให้ได้ว่าให้บู๊ตเข้าซีดีเป็นอันดับแรก ฮาร์ดดิสก์เป็นอันดับรองลงมา ปกติจะเข้าไบออสก็ต้องกดปุ่ม "Del" หรือ "F2" ก็สุดแท้แต่ในขณะที่บู๊ตเครื่องใหม่ (หากคุณทำไม่เป็น ก็จงหาผู้ช่วยซะ)</li>

<li>ไชโยไชยะ ลินุกซ์โลดแล่นอยู่บนเครื่องของคุณแล้ว คุณสามารถลองภูมิของมันได้ ดูว่าคุณชอบมันไหม อย่าเป็นกังวลหากระบบมันทำงานช้าไปบ้าง ก็มันต้องโหลดทุกสิ่งอย่างอันโดยตรงจากซีดี หากคุณติดตั้งลงฮาร์ดดิสก์มันย่อมวิ่งกระจายกว่านี้</li>

</ul>

<p>แล้วคุณจะดาวน์โหลดอิมเมจนี้ได้จากแห่งหนตำบลใด? มีแหล่งลินุกซ์ซีดีสดมากมายบนเว็บ! คุณอาจลองจากแถวนี้ก่อนก็ได้</p>

<table cols="2">
<tr>
<th>อูบุนตูสด-Ubuntu Live</th>
<th>คานอพพิกซ์-Knoppix</th>
</tr>

<tr>
<td><a href="Images/ubuntu.png"><img src="Images/ubuntu_thumbnail.png" /></a></td>
<td><a href="Images/knoppix.png"><img src="Images/knoppix_thumbnail.png" /></a></td>
</tr>

<tr>
<td><a 
href="http://www.ubuntu.com/download">http://www.ubuntu.com/download</a></td>
<td><a 
href="http://www.knoppix.net/get.php">http://www.knoppix.net/get.php</a></td>
</tr>

</table>

</div>
</body>
</html>
