

<h2>សាក​ល្បង"ស៊ីឌី​បន្ត​ផ្ទាល់"</h2>

<p> អ្នក​អាច​សាក​ល្បង​លីនុច​ដូច​ជា​ប្រព័ន្ធ​ប្រតិបត្តិការ​ពិតៗ ​​ដោយ​មិន​ចាំបាច់​ប៉ះ​ពាល់​​ថាស​រឹង​របស់​អ្នកនោះទេ
ដោយ​មិន​ចាំបាច់​​ធ្វើ​អ្វី​ទាំងអស់​​ជា​មួយ​នឹង​​​វីនដូដែល​មាន​ស្រាប់​របស់​អ្នកឡើយ !</p>

<p>វា​​អាច​ប្រើបាន​ជា​មួយ​នឹង​ "​ស៊ីឌី​បន្ត​ផ្ទាល់​របស់​លីនុច​" ។ ស៊ីឌី​បន្ត​ផ្ទាល់ដំណើរការ​តាម​វិធី​ដូច​ខាងក្រោម ៖ </p>

<ul>

<li> ទាញយក​រូប​ភាព​ស៊ីឌី​ពីបណ្ដាញ​ (វាជា​ឯកសារ​​ <tt>.iso </tt> 
ដែល​មាន​ទំហំ​ប្រហែលជា ៦៥០ មេកាបៃ) ។ </li>

<li> ដុត​វា​ទៅ​ក្នុង​​ស៊ីឌី​ទទេ​ ។</li>

<li> ដាក់​​ស៊ីឌី​នៅ​ក្នុង​ដ្រាយ​ស៊ីឌី​របស់​អ្នក ហើយ​ចាប់ផ្ដើម​ឡើង​វិញ​ ។ </li>

<li> កុំព្យូទ័រ​របស់​អ្នក​នឹងចាប់ផ្ដើម​ឡើង​ពី​ស៊ីឌី ​ដោយ​មិន​​​ចាប់​ផ្តើម​ឡើង​ពី​ដ្រាយ​រឹង​នោះទេ​
 (ដែលមាន​វីនដូ) ហើយ​នឹង <b>មិន​ប៉ះ​ពាល់អ្វី​ឡើយ</b> ៖
កុំបារម្ភ​អំពី​វីនដូ និង​ទិន្នន័យ​របស់​អ្នក​ ពួក​វា​​​​នៅ​តែមាន​​​ ​ពេល​ដែល​ចាប់​ផ្តើម​ឡើង​វិញ​ម្តង​ទៀត​ដោយ​​គ្មាន​​ស៊ីឌី​ ។ </li>

<li>ប្រសិន​បើ​កុំ​ព្យូទ័រ​របស់​អ្នក​នៅ​តែ​ចាប់​ផ្តើម​ឡើង​​ពី​វីនដូ​ (​ស៊ីឌីហាក់​បី​ដូច​ជាមិន​​មានប្រសិទ្ធភាព​ទេ​ )
នោះ​ការ​កំណត់​រចនាសម្ព័ន្ធ BIOS របស់​​អ្នក​មិន​ត្រឹមត្រូវ​ទេ ៖ អ្នក​ត្រូវ​​​តែ​ឲ្យ​វា​​​វិភាគ​រក​​​ដ្រាយ​ស៊ីឌីដំបូងសម្រាប់​ប្រព័ន្ធ​ប្រតិបត្តិ និង​បន្ទាប់​​មក​វិភាក​រក​​ថាស​​រឹង​ ។ 
តាម​ធម្មតា អ្នក​អាច​ចូលដំណើរ​ការ​ BIOS ដោយ​ចុច​គ្រាប់ចុច​លុប​ "Del" ឬ "F2" 
អំឡុង​ពេល​កំពុង​ចាប់​ផ្តើមឡើង (ប្រសិនបើ​​អ្នក​គិត​ថា វា​ពិបាក​នោះ ​អ្នក​ត្រូវ​តែ​រក​ជំនួយ) ។</li>

<li>រួចរាល់​ហើយ លី​នុច​ដំណើរ​ការ​​ក្នុង​​ប្រព័ន្ធ​​ប្រតិបត្តិការ​របស់​អ្នក​ អ្នក​អាច​សាក​ល្បង​វា​ និង​មើល​ថាតើ​ថា​ អ្នក​ចូល​ចិត្តវា​ដែរឬទេ !
 កុំបារម្ភ ប្រសិន​បើ​ប្រព័ន្ធ​ហាក់​បី​ដូចជា​យឺត​ៗ​បន្តិច​​ពេល​នេះ​ ៖
វា​​ត្រូវ​ការ​ពេលវេលា ​ដើម្បី​​ផ្ទុក​អ្វីៗ​​ផ្សេងៗ​ពី​​​​ស៊ីឌី ។​​ ប្រព័ន្ធ​លីនុច​របស់​អ្នក​ នឹង​ដំណើរការ​យ៉ាង​លឿន នៅពេល​ដែល​បាន​​​ដំឡើង​ក្នុង​​ថាសរឹង​របស់​អ្នក ។
</li>

</ul>

<p> ដូច្នេះ​ តើ​អ្នក​អាចទាញយករូបភាព​​ស៊ីឌី​ទាំង​​នោះ​ពី​កន្លែង​ណា ? មាន​ស៊ីឌី​បន្តផ្ទាល់​របស់​​លីនុច​​ជា​ច្រើន​នៅ​លើ​បណ្តាញ !
អ្នក​អាច​សាកល្បង​ស៊ីឌី​បន្តផ្ទាល់​មួយ​ក្នុង​ចំណោម​ស៊ីឌី​បន្តផ្ទាល់​ទាំង​នេះ​​ ឧទាហរណ៍ ៖</p>

<table cols="2">
<tr>
<th>ស៊ីឌី​បន្ត​ផ្ទាល់​របស់ Ubuntu </th>
<th>Knoppix</th>
</tr>

<tr>
<td><a href="Images/ubuntu.png"><img src="Images/ubuntu_thumbnail.png" /></a></td>
<td><a href="Images/knoppix.png"><img src="Images/knoppix_thumbnail.png" /></a></td>
</tr>

<tr>
<td><a 
href="http://www.ubuntu.com/download">http://www.ubuntu.com/download</a></td>
<td><a 
href="http://www.knoppix.net/get.php">http://www.knoppix.net/get.php</a></td>
</tr>

</table>

</div>
</body>
</html>
