

---
title: Испытайте "живой CD/DVD"</h2>

<p>Вы можете испытать Linux без каких-либо изменений в существующей ОС!</p>

<p>Это возможно благодаря "Linux живым CD" (лайв-cd). Работает это таким образом:</p>

<ul>

<li>Скачайте образ диска из интернета (это будет <tt>.iso</tt> 
файл, около 700 MB для CD и 4 гб для DVD). </li>

<li>Запишите образ на чистый носитель.</li>

<li>Вставьте (или не доставайте ;) носитель в привод и перезагрузитесь.</li>

<li>Ваш компьютер загрузится с диска вместо того, чтобы загружаться с жёсткого
диска (там где Windows), при этом вы <b>не затроните никаких данных на HDD</b> : 
не волнуйтесь о Windows и ваших файлах, они будут на месте после того, как
вы перезагрузитесь без диска. </li>

<li>Тем не менее, если ваш компьютер по прежнему загружает Windows, 
это может значить что ваш BIOS настроен на загрузку с HDD. Вам нужно
поменять порядок загрузки системы так, чтобы в начале компьютер проверял
наличие носителя в приводе, и только потом загружался с HDD. Попасть
в BIOS можно, нажав клавишу DEL или F2 за несколько секунд до начала 
загрузки Windows (почти сразу после физической перезагрузки вашего компьютера).
Если вы не находите нужного в BIOS, позовите любого мало-мальски серьезного
айтишника.</li>

<li>Ура! Linux загрузился (после того, как вы выбрали "загрузить живой CD" в
меню, предлагаемом диском). Теперь вы можете протестировать этот дистрибутив
Linux и оценить, насколько он вам подходит. Однако учтите: "живая" система, 
работающая с диска, будет сильно тормозить. После установки Linux на винчестер,
задержки при запуске каждой программы пропадут и система станет работать быстро
(буквально летать) - намного быстрее, чем Windows. Столь медленная работа с LiveCD
объясняется тем, что дистрибутив вынужден загружать каждый пакет с диска в оперативную
память, а этот процесс занимает значительное время. 
</li>

</ul>

<p>Итак, где же можно скачать образы дисков? Есть множество мест, доступных в 
интернете. Вы можете попробовать эти, к примеру:</p>

<table cols="2">
<tr>
<th>Ubuntu Live</th>
<th>Knoppix</th>
</tr>

<tr>
<td><a href="Images/ubuntu.png"><img src="Images/ubuntu_thumbnail.png" /></a></td>
<td><a href="Images/knoppix.png"><img src="Images/knoppix_thumbnail.png" /></a></td>
</tr>

<tr>
<td><a 
href="http://www.ubuntu.com/download">http://www.ubuntu.com/download</a></td>
<td><a 
href="http://www.knoppix.net/get.php">http://www.knoppix.net/get.php</a></td>
</tr>

</table>

</div>
</body>
</html>
