<?php require("entete.php"); ?> <?php require("base.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>Небольшой FAQ для Linux-гиков</h2>

<p>Итак, я, пожалуй, начну с того, что, как вы наверно уже заметили, этот веб-сайт в действительности предназначен не вам :) Он предназначен для пользователей Windows (или Mac), пытающихся узнать, что же такое "Linux", как он выглядит, и есть ли в нем вообще что-то привлекательное для них. Вы, вероятно, не найдете на странице ничего нового и можете как и прежде продолжать читать slashdot! :-p</p>

<ul>

<li><p><b>В: Linux - не полноценная ОС как, скажем, Windows, а всего лишь ядро. Зачем же обманывать пользователей?

</b></p> <p>О: Святой Линус, пожалуйста, прости меня :) Это намеренное упрощение. Если вы начнете объяснять тот факт, что Linux - это лишь название ядра, и что различные вендоры решают в каком составе ПО поставлять Linux, создавая таким образом "дистрибутив Linux и т.д., то уже половина посетителей сайта его покинет. Этот сайт не предназначен для людей, уже использующих Linux в качестве основной ОС (если только они не хотят помочь развитию сайта). По тем же причинам и ради упрощения я не говорю о разных вариантах BSD и том факте, что многие крупные сервера работают под управлением BSD, а не Linux.



<li><p><b>В: Почему вы говорите, что одна ОС лучше другой? Ведь это зависит от того, что людям нужно от нее.

</b></p> <p>О: Безусловно, это так. Я полностью согласен. Но давайте попробуем выяснить, что я пытаюсь этим сказать: 1) Позволить пользователям Windows/Mac OS X знать, что есть кое что еще. 2) Привести несколько причин, почему Linux на самом деле хорошая система, и почему бОльшую часть времени выбор в его пользу вполне оправдан. Понятно, что имя сайта слишком прямолинейное для этого, но эй, разве мне стоило купить домен whylinuxmaybebetterinmanycases.net? (Название сайта whylinuxisbetter переводится как "Почему Линукс лучше", а whylinuxmaybebetterinmanycases можно перевести как "Почему Линукс может быть лучше во многих случаях", прим. ред.)

Я не Linux эксперт, не лидер секты, и я не хочу проповедовать: Я всего лишь безумно счастливый пользователь и разработчик Linux, пытающийся познакомить больше людей с этой ОС.



<li><p><b>В: Правильно GNU/Linux, а не Linux, дурак!

</b></p> <p>О: На сайте для опытных Linux пользователей эта деталь имела бы значение. Но давайте не будем усложнять. Люди слышат о "Линукс", а не "ГНУ/Линукс", и такой вид идеологического спора, возможно, одна из вещей, которая отталкивает "обычных" людей от понимания всего этого. По той же причине я пишу "OpenOffice" вместо "OpenOffice.org" и так далее.</p> 
</li>


<li><p><b>В: Я хочу оказать помощь в переводе сайта на мой родной язык. Ты заинтересован?

</b></p> <p>О: Определенно! Не стесняйтесь писать мне на ideas@whylinuxisbetter.net. И если ваш родной язык Английский, пожалуйста, присылайте мне доказательства моего плохого Английского на этот же адрес, чтобы я мог исправить ошибки.</p> 
</li>



<li><p><b>В: Похоже. что ты привержен Gnome и Ubuntu. Какие-то сложности на счет KDE и других дистрибутивов?

</b></p> <p>О: Конечно же нет. Мне нравятся и я использую многие приложения KDE (if all the efforts put about GNOME vs KDE trolls could be invested in nicely integrating KDE apps in GNOME and the other way around, I'd be really happy). На моих скриншотах преимущественно Ubuntu, потому что это дистрибутив, который я использую и в разработке которого принимаю участие. Нет необходимости говорить, что вы можете спокойно присылать мне любые другие скриншоты. Вы, возможно, уже заметили, что у меня есть пунктик по поводу AmaroK, не стесняйтесь присылать мне рекомендации других программ KDE (или Gnome).</p> 
</li>



<li><p><b>В: Да что ты вообще знаешь о Linux?

</b></p> <p>О: Вероятно не столько,  сколько должен бы! Я член Ubuntu, я использовал Linux с ~1998, написал несколько карманных книжек (на Французском) о некоторых свободных программах (Firefox, Linux, и т.д.). Но я надэтим работаю, Я как раз заказал книгу "Понимание ядра Linux" (В то время как вы это читаете, я, возможно, уже закончил чтение этой книги, все в ней понял и хочу создать свою собственную версию, которую я без сомнения назову "Manux" (Манукс) -- хорошо, может и нет).</p> 
</li>


<li><p><b>В: Ты сказал, что геймеры не должны переходить на Linux, но разве ты не знаешь о Wine, Cedega? На них нелохо работает растущее количество Windows-игр.

</b></p> <p>О: Я согласен, что многие программные решения позволяют запускать игры для Windows намного проще, чем это было раньше. Это хорошее решение для обычных игроков. Между тем, заметьте, что я использовал выражение "хардкорные игроки", те, кто покуает самые свежие игры и разгоняют процессоры для получения наивысшей производительности; Я сомневаюсь, что они будут готовы пойти на такой компромисс.</p> 
</li>



<li><p><b>В: Пожалуйста, добавь дистрибутив XYZ на страницу дистрибутивов для установки Linux.

</b></p> <p>О: В мире много-много дистрибутивов, и любая их ограниченная подборка не может удовлетворить каждого. Желающих попробовать Linux уже смущает то, что есть несколько его "версий/сборок". Я решил предложить 4 из них, тех, что были и по сей день остаются самыми популярными. Я думаю, это оправданный выбор.</p> 
</li>



<li><p><b>В: Эй, а ты случайно не из тех парней, что занимаются PCJacking-ом?

</b></p> <p>О: Упс, ага.</p> 
</li>



<li><p><b>В: Слушай, а ты случайно не из тех ненормальных GIMP-Texturize парней?

</b></p> <p>О: Да, вы меня раскусили. :) Но Jean-Baptiste Rouquier сделал половину работы. Хорошо, больше половины. Ох, следующий вопрос, пожалуйста.</p> 
</li>



<li><p><b>В: Эй, ты не один из тех чокнутых парней Google's Summer of Code ("Лето кода Google"), один из первых 400 из 9000 избранных хакеров?

</b></p> <p>О: Да. Но мне просто повезло: Я отправил 8000 из всех 9000 проектов, и один из них прошел. А вообще, мне повезло дважды (2005, 2006). В следующем году я собираюсь открыть исходные коды моего автоматического генератора проектов.</p> 
</li>

</ul>

</div>

</body>
</html>
