<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html style="direction: rtl;" lang="fa">
<head>
  <meta content="text/html;charset=UTF-8" http-equiv="Content-Type">
<?php require("entete.php"); ?><?php require("base.php"); ?><?php require("fonctions.php"); ?>
</head>
  

<body>
<div style="font-family: Tahoma;" id="corps">

<h2>پرسشهاي رايج كاربران لينوكس از من</h2>


<p>خوب همونطور كه خودتون هم فهميدين اين وب سايت براي شما نيست!من اين
سايت رو براي كساني طراحي كردم كه كاربران ويندوز و يا مكينتاش هستند و
چيزي درباره لينوكس
نميدونن.اونها مي&zwnj;خوان بدونن لينوكس چيه،چه شكليه و چي داره.شما ممكنه چيز
جديدي تو اين سايت پيدا نكنيد و فقط همينجوري بخونينش </p>


<ul>
  <li>
    <p><b>Q: لينوكس هرگز مثل ويندوز سيستم عامل كاملي نيست.اون فقط يك هسته است.چرا كاربران رو گول مي&zwnj;زنيم؟&nbsp;</b></p>
 
    <p>A:
جناب لينوس
منو ببخش:) ببينيد اين يك ساده كردن داوطلبانه است.اگر ما بخوايم بگيم كه
اين حقيقت داره كه لينوكس در اصل اسم هسته سيستم عامله و شركتها و اشخاص
مختلف
اومدن و توزيع خاص خودشون رو با ويرايش اين هسته و اضافه كردن يك سري نرم
افزار ديگه ساختن خوب نصف مردم بيخيال لينوكس ميشدن! باز هم ميگم اين سايت
براي كساني نيست كه كاربران اصلي لينوكس اند و لينوكس رو بعنوان سيستم عامل
اصليشون استفاده مي&zwnj;كنن.گرچه من همواره با آغوش باز پيشنهادهاي شما رو
مي&zwnj;پذيرم..</p>
 </li>
  <li>
    <p><b>Q: چرا شما همش ميگی فلان سيستم عامل از اون يكي بهتره؟اين بستگي داره كه كي مي&zwnj;خواد با كامپيوترش چيكار بكنه.</b></p>

    <p>A: البته كه همينطوره.من كاملاً موافقم اما بذاريد هدفم رو هم بگم: 1)
به كاربران ويندوز و مكينتاش نشون بدم كه فضاي ديگري هم هست. 2) مي&zwnj;خوام
چند دليل رو بگم كه نشون بدم لينوكس سيستم عامل خوبيه و در برخي موارد
بهترين انتخابه.گرچه نام سايت اين رو نشون نميده اما از من انتظار نداشته
باشين كه اين آدرس رو براي سايت انتخاب كنم whylinuxmaybebetterinmanycases.net&nbsp;</p>


    <p>من نه يك كاربر حرفه&zwnj;اي لينوكس ام و نه يك رهبر گروه،من فقط
يك كاربر خوشحال و برنامه نويس لينوكس ام كه مي&zwnj;خوام ديگرون رو هم با
اين
سيستم آشنا كنم</p>


  </li>
  <li>
    <p><b>Q: اسم اصلی GNU/LINUX است نه LINUX احمق!</b></p>

    <p>A:در يك وب سايت كاربران پيشرفته،اين جزييات مهمن اما در اينجا نه.اين
سايت براي مبتدياست پس بذارين از كلمات ساده استفاده كنيم.مردم با
كلمه"لينوكس"بيشترآشنا
هستند,</p>
  </li>
  <li>
    <p>مثلا من مینویسم "OpenOffice"ونه"OpenOffice.org" </p>


    <p>آما به هرحال اين آخري سوال نبود و يك پند بود اما چون من به يك غير سؤال جواب دادم پس واقعاً احمقم!</p>


  </li>
  <li>
    <p><b>Q:هي مرد،انگليسي تو افتضاحه!</b></p>

    <p>A: بله مي&zwnj;دونم ولي دارم روش كار مي&zwnj;كنم.بيخيال</p>

  </li>
  <li>
    <p><span style="font-weight: bold;">Q:چرا حالا گیر دادی به Ubuntu و GNOME؟از KDE و توزییعهای دیگه بدت میاد؟</span></p>
 
    <p>A: البته كه نه! من KDE وبرنامه هاش رو دوست دارم&nbsp;&nbsp; (اگر
همه تلاشها بر اين بودكه برنامه هاي اين دو محيط كاري در هم ادغام میشد
حال ميداد!).عکسهای توی اسن سایت از Ubuntu هست چون این توزیعیه که من ازش
استفاده میکنم و براش برنامه می نویسم.نیازی به گفتن نیست اما شما هم می
تونین عکسهای صفحه خودتون رو واسه من بفرستین.ممکنه متوجه شدین که توی این
سایت یه بخش درباره amaroK هست و خوشحال میشم اگه عکسها و نوشته های
خودتون رو درمورد برنامه های دیگر KDE والبته GNOME واسم بفرستین.</p>
 </li>
  <li>
    <p><b>Q: ديگه چيا درباره لينوكس ميدوني؟</b></p>
 
    <p>A: احتمالاً نه به اندازه&zwnj;اي كه بايد بدونم! من يكي از اعضاي جنبش
اوبانتو هستم و چند تا برنامه و چند تا كتابچه راهنماي كوچك هم (البته به
زبان فرانسوي)در مورد برخي نرم افزارهاي اوپن سورس مثل
لينوكس و فايرفاكس نوشتم و از سال 1998 هم از لينوكس استفاده مي&zwnj;كنم
اما درحال بهبود اين وضع هستم
,من اخيرا كتاب"Understand the Linux kernel" رو خريدم
( ممكنه زمانيكه شما اين نوشته رو مي&zwnj;خونيد تمومش كرده
باشم و بتونم هسته لنوكس خودم رو بنويسم و اسمشو بذارم"Manux"شايدم نه!).</p>
 </li>
  <li>
    <p><b>Q: هي،تو اون يارو <a href="http://www.manucornet.net/pcjacking">PCJacking</a> نيستي؟&nbsp;</b></p>

    <p>A: خودمم</p>

  </li>
  <li>
    <p><b>Q: هي،تو ايون يارو <a href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a> 
نيستي؟&nbsp;</b></p>

    <p>A: چرا،خودمم :) اما <a href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a> هم نصف كار رو انجام داد..
سؤال بعدي!</p>

  </li>
  <li>
    <p><b>Q: هي،تو يكي از اون احمقاي <a href="http://code.google.com/summerofcode.html">Google's Summer of 
code</a> نبودي؟, يكي از اون 400 هكر انتخابي از بين 9000 نفر؟&nbsp;</b></p>
 
    <p>A: 
چرا بودم اما اين شانسي بود!در اصل 8000 تا از اون 9000 پروژه مال من بود كه يكيش انتخاب شد.
سال ديگه من مي&zwnj;خوام برنامه پروژه ساز خودكار ام رو منتشر كنم! :) </p>
 </li>
<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->
</ul>


</div>

</body>
</html>
