<?php require("entete.php"); ?> <?php require("base_bg.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>Малък списък с често задавани въпроси за Линукс разбирачи</h2>

<p>Добре, може да започна с това, че както вероятно сте забелязали, този сайт не е за вас. :) Той е за Windows (или Mac) потребители, които се опитват да разберат какво е "Линукс", как изглежда и има ли нещо полезно за тях. Вероятно няма да намерите тук нова информация и може би ще продължите да четете на други места! :-p </p>

<ul>

<li><p><b>В: За Линукс трудно може да се каже, че е пълна ОС като Windows, това е просто ядрото. Защо да се карат потребителите да мислят другояче?</b></p> <p>О: Свети Линус, прости ми! :) Това е доброволно опростяване. Ако тръгнете да обяснявате, че всъщност Линукс е името на ядрото и различни доставчици избират да разпространяват Линукс със софтуер по техен избор, за да направят "Линукс дистрибуция" и т.н., половината от аудиторията вече ще е напуснала. Това не е уеб сайт за хора, които вече използват Линукс като своя основна ОС (освен ако, те желаят да помогнат на сайта да стане по-добър -- и да коригират моят Английски, имам нужда!).</p> </li>

<li><p><b>В: Защо казваш, че една ОС е по-добра от друга? Зависи от това, какво хората искат да правят с нея.</b></p>
<p>О: Напълно съм съгласен, така е. Но нека съм ясен, какво се опитвам да кажа тук: 1) Нека Windows/Mac OS X потребителите знаят, че има и нещо друго. 2) Да дам няколко причини, поради които Линукс е наистина добра система и през повечето време е доста добър избор. Очевидно името на сайта е по-директно от това, но да не би да трябваше да си купя <tt>whylinuxmaybebetterinmanycases.net</tt> ?</p>

<p>Не съм Линукс експерт или лидер на някаква секта и не искам да проповядвам: Просто съм изключително доволен потребител и разработчик на Линукс, опитващ се да накара повече хора да узнаят за Линукс.</p>

</li>

<li><p><b>В: Казва се ГНУ/Линукс, а не Линукс, тъпчо!</b></p>
<p>О: В уеб сайт за напреднали Линукс потребители такива детайли биха имали значение. Но нека запазим нещата прости. Хората чуват за "Линукс", а не за "ГНУ/Линукс" и този тип разбираческо заяждане вероятно е едно от нещата, които пречат на "нормалните" хора да разберат за какво става въпрос. Поради същата причина пиша "OpenOffice" вместо 
"OpenOffice.org" и т.н.</p>

<p>И между другото този "В:" не е въпрос, тъй като няма въпросителен знак. Но така или иначе, аз пиша и въпросите и отговорите... Олеле, наистина съм глупав.</p>

</li>

<li><p><b>В: Човече, имаш отвратителен Английски.</b></p>
<p>О: Да, знам. Работя по него. Не ме бийте моля.</p>
</li>

<li><p><b>В: Бих желал да допринеса, като преведа уеб сайта на родният си език, заинтересован ли си?</b></p>
<p>О: Определено! Чувствайте се свободни да ми пишете писмо на <a 
href="mailto:ideas@whylinuxisbetter.net">ideas@whylinuxisbetter.net</a>. 
И ако Английският ви е майчин език, изпратете доказателство за лошия ми Английски, за да мога да си поправя грешките.</p>
</li>

<li><p><b>В: Изглежда се концентрираш върху GNOME и Ubuntu. Нещо против KDE и другите дистрибуции?</b></p> <p>О: Разбира се, че не. Обичам и използвам много KDE приложения (ако всички усилия, влагани в безсмислени спорове Gnome срещу KDE, се инвестират в хубаво интегриране на KDE програми в Gnome и обратно, ще съм наистина щастлив). Прихванатите ми екрани показват предимно Ubuntu, защото това е дистрибуцията, която използвам и за която разработвам софтуер. Няма смисъл да казвам, спокойно ми изпращайте други прихванати екрани. Може да сте забелязали, че имам статия за AmaroK, не се колебайте да ми изпращате предложения за други KDE (и GNOME!) приложения.</p> </li>

<li><p><b>В: Какво, по дяволите, изобщо знаеш ти за Линукс?</b></p> 
<p>О: Вероятно не толкова, колкото би трябвало! Член съм на Ubuntu, използвам Линукс от ~1998, написах няколко джобни книги (на Френски) за програми с отворен код (Firefox, Линукс и т.н.). но се опитвам да поправя това. Току що си поръчах книгата "Да разберем Линукс ядрото" (по времето, по което четете това, трябва вече да съм я прочел, да съм разбрал каквото има за разбиране за Линукс и да искам да създам своя версия, която без съмнение ще нарека "Manux" -- добре, може би няма :-p).</p> </li>

<li><p><b>В: Хей, ти не си ли оня смахнат <a 
href="http://www.manucornet.net/pcjacking">PCJacking</a> тип ?</b></p>
<p>О: Уупс, да.</p>
</li>

<li><p><b>В: Хей, ти не си ли оня смахнат <a 
href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a> 
тип ?</b></p>
<p>О: Да, хвана ме :) Но <a 
href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a> също свърши половината работа. Добре, повече. Ъъ, следващият въпрос моля.</p>
</li>

<li><p><b>В: Хей, ти не си ли от ония смахнати <a 
href="http://code.google.com/summerofcode.html">Google's Summer of 
code</a> типове, един от 400-от-общо-9000 избрани хакери?</b></p> <p>О: 
Да. Но просто бях късметлия: Изпратих 8000 от тези 9000 проектни предложения и едно от тях бе прието. Следващата година свободно ще пусна моят автоматичен генератор на проекти.</p> </li>


<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>

</body>
</html>
