<?php require("entete.php"); ?> <?php require("base.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>給 Linux 玩家們的小問答集</h2>

<p>好吧，先這麼說好了。也許你已經注意到，這個網頁對你來說沒有太大的意義。:)  這是針對 Windows（或 Mac）的使用者，試圖為他們解釋什麼是「Linux」、它看起來怎麼樣，以及是否有什麼對他們有幫助的東西在裡面。也許你不會在這裡發現什麼新資訊，然後轉頭繼續瀏覽 Slashdot！  :P</p>

<ul>

<li><p><b>問：Linux 只是個 kernel，而不是 Windows 那樣一套完整的作業系統。為什麼要讓使用者誤解呢？</b></p>
<p>答：偉大的 Linus 請原諒我。:)  這是故意簡化的。如果你開始解釋 Linux 事實上只是 kernel 的名字、不同的經銷商會把 Linux 和他們挑選的軟體包裝成「Linux 版本」等等，一半的聽眾已經離席了。對於已經用 Linux 當作主要作業系統的人，這個網站不是針對他們的（除非他們想要幫忙讓這個網站變得更好）。基於同樣的理由，也就是為了簡化，我沒有討論到 BSD，以及事實上很多<b>大型</b>的伺服器是使用 BSD 而非 Linux。</p> 
</li>

<li><p><b>問：你怎麼能說一套作業系統比另一套出色？這取決於人們想要用它做什麼事情啊。</b></p>
<p>答：我完全同意，當然是這樣沒錯。但是，這只是為了讓我想表達的事情變得清楚一點：
<ol>
<li>讓 Windows 和 Mac OS X 的使用者知道，除了它們，還有別的系統存在著。</li>
<li>列出一些原因，說明為什麼 Linux 真的是不錯的系統，以及為什麼絕大多數的時候，它會是一個好選擇。</li>
</ol></p>
<p>很顯然，網站的名稱比起這些又來得更簡潔。不過，嘿，難道我應該買下 <tt>whylinuxmaybebetterinmanycases.net</tt> 嗎？</p>
<p>我不是 Linux 的專家，也不是什麼黨派的領袖，更不想傳教：我只是一個很開心的 Linux 使用者和開發人員，只是試著讓更多人認識 Linux。</p>
</li>

<a name="gnu"><li><p><b>問：蠢蛋，是 GNU/Linux 而不是 Linux！</b></p></a>
<p>答：一個針對進階 Linux 使用者的網站，這樣的細節是重要的。但是，讓我們把事情變得簡單一點。大部分的人聽過「Linux」而不是「GNU/Linux」，而且這種怪異的爭論，也許正是導致「一般」普羅大眾無法理解 Linux 究竟是什麼的原因之一。同樣的理由，我寫成「OpenOffice」而不是「OpenOffice.org」等等。</p>

<p>對了順便提一下，這裡的「問：」它不應該是一個問題，因為它後面沒有問號。不過，反正我同時寫上了問題和解答…天啊我真是個蠢蛋。</p>
</li>

<li><p><b>問：老兄，你的英文真破。</b></p>
<p>答：對啊我知道，而且我正在努力中。請繼續鞭策我吧。</p>
</li>

<li><p><b>問：你似乎致力於 GNOME 和 Ubuntu。KDE 或其他 Linux 版本帶給你什麼不好的感覺嗎？</b></p>
<p>答：當然沒有。我喜歡而且也使用了很多 KDE 的應用程式（如果把 GNOME 和 KDE 這兩大巨人彼此對抗的力氣，投入那些在 GNOME 上出色又有趣的 KDE 應用程式，反之亦然，我真的會很開心）。我的截圖大部分都是取自 Ubuntu，因為那是我在使用和開發的版本。不用說，當然隨時都能寄給我其他的截圖。也許你注意到了，我有一張 AmaroK 的截圖。不用猶豫，趕快寄給我更多關於 KDE（還有 GNOME！）應用程式的建議吧。</p> </li>

<li><p><b>問：有沒有搞錯，你到底懂不懂 Linux 啊？</b></p> 
<p>答：我懂得還不夠多！我是 Ubuntu 的一員，我從 1998 年使用 Linux 到現在，（用法文）寫了幾本關於開放原始碼軟體（Firefox 和 Linux 等等）的口袋書。但是我正試著繼續進步，也訂了「Understand the Linux Kernel」這本書。（當你看見這篇文章，我也許已經讀完它，也瞭解了書裡所介紹的 Linux 知識，並想著要創造屬於自己的版本。我將會把它命名為「Manux」－好吧，也許不會取這個名字。）</p> </li>

<a name="gaming"><li><p><b>問：你說遊戲玩家不應該改用 Linux，但是你知道 Wine 和 Cedega 和 Steam 嗎？愈來愈多的 Windows 遊戲可以用它們執行得很好。</b></p></a>
<p>答：許多的軟體解決方案，把在 Linux 上玩 Windows 遊戲這件事，比起以前變得簡單許多，這點我同意。對於輕度玩家來說這是很好的解決之道。但是注意到我用的是「重度玩家」這個詞彙，這些人會購買最新上市的遊戲，同時也會為了得到更好的效能，對 CPU 進行超頻。這些玩家是否願意對這幾件事做出妥協，我持著保留的態度。</p></li>

<a name="distros"><li><p><b>問：請把 Linux 版本 XYZ 納入介紹如何安裝 Linux 的網頁。</b></p></a>
<p>答：有太多太多的版本這裡沒有介紹，而且任何一個版本都不可能滿足所有人。對於那些想嘗試 Linux 的人，光是 Linux 有好幾種「版本」和「風味」就已經讓他們很頭大了。我挑選從過去到現在、持續最受歡迎的版本中挑選四個來介紹，我想這是一個合理的選擇。
</p></li>

<li><p><b>問：嘿，你是那個在做 <a href="http://www.manucornet.net/pcjacking">PCJacking</a> 的怪咖嗎？</b></p>
<p>答：噢，沒錯。</p>
<p>譯註：PCJacking 指的是，帶著一些 Linux Live CD 到熱鬧的百貨公司，把它們放進展示的電腦裡，讓顧客知道除了 Windows 之外，還有其他好用的系統存在著。</p>
</li>

<li><p><b>問：嘿，你是那個在做 <a href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a> 的怪咖嗎？</b></p>
<p>答：沒錯，被你發現了。:)  但是 <a href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a> 也出了一半了力。好吧，比一半還多啦。嗯，下一題。</p>
<p>譯註：GIMP-Texturize 是 GIMP 這套修圖軟體的外掛程式，它能把一張小圖經過重複拼貼後，擴張變成一張大圖，而且看不出這些小圖彼此間的接縫。</p>
</li>

<li><p><b>問：嘿，你不就是參加 <a 
href="http://code.google.com/soc/">Google's Summer of 
code</a> 的其中一名高手，也是從九千人中脫穎而出的四百名駭客的其中一人？</b></p>
<p>答：沒錯。不過我只是運氣好：收到的九千份專案計畫書，我就送了八千份，然後其中一份被錄取了。好吧，我走運了兩次（2005 和 2006 年）。明年我就要公佈那個專案自動產生器的原始碼。</p> </li>


<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>

</body>
</html>
