<?php require("entete.php"); ?> <?php require("base.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>សំណួរ​ដែល​សួរ​រឿយ​ៗ​​​សម្រាប់អ្នក​ជំនាញ​ខាង​លីនុច​</h2>

<p>​ខ្ញុំ​គួរ​តែ​ចាប់​ផ្តើម​ដោយ​និយាយ​ថា​ ពិត​មែន​ហើយ ដូច​ដែល​អ្នក​​​​ធ្លាប់​បាន​សង្កេត​រួច​មក​ហើយ​ថា​ 
តំបន់​បណ្តាញ​នេះ​ពិត​ជា​មិន​មាន​ន័យ​សម្រាប់​អ្នក​ទេ​ :) វា​មាន​ន័យ​សម្រាប់តែ​​​​ 
អ្នក​ប្រើ​វីន​ដូ  (ឬ​ Mac​) ដែល​ព្យាយាម​ស្វែង​យល់​ថា​"លីនុច​" គឺ​ជា​អ្វី​ តើ​វា​មាន​ 
លក្ខណៈ​ដូច​ម្តេច​ និង​ចង់​ឃើញ​ថា​តើ​វា​មាន​អ្វី​ល្អ​ ឬអត់​​​ ។ អ្នក​ 
ប្រហែល​ជា​​​មិន​អាច​រក​ឃើញ​ព័ត៌​មាន​ថ្មី​ណា​មួយ​នៅ​ទី​នេះ​ទេ​ ហើយ​អ្នក​ប្រហែល​ជា​កំពុង​ ​អាន​
slashdot ផង​ដែរ​! :-p </p>

<ul>

<li><p><b>សំណួ​រ​៖ លី​នុច​គឺ​មិន​មែន​ជា​ប្រព័ន្ធ​ប្រតិបត្តិការ​ពេញ​លេញ​ដូច​វីន​ដូ​ទេ​ វា​គ្រាន់​តែជា​​ 
ខឺណែល​ប៉ុណ្ណោះ​ ។ ​ហេតុ​អ្វី​ចាំ​បាច់​ឲ្យ​អ្នក​ប្រើ​ទុក​ចិត្ត​លើ​វា​ ?</b></p> <p>ចម្លើយ​ ៖ Saint Linus 
សូម​អភ័យ​​ទោស​ឲ្យ​ខ្ញុំ​ផង​ :) វា​គ្រាន់​តែ​ជា​ការ​បក​ស្រាយ​សាមញ្ញ​មួយ​ប៉ុណ្ណោះ ។ ​ប្រសិន​បើ​អ្នក​ចាប់​ផ្តើម​ 
ពន្យល់​ពី​រឿង​នេះ​ ការ​ពិត​គឺ​ថា​លីនុច​គឺ​ជា​ឈ្មោះ​របស់​ខឺណែល​ ហើយ​​ 
ក្រុម​ហ៊ុន​លក់​នានា​នឹង​ជ្រើស​​រើស ដើម្បី​​បញ្ជូន​​លីនុច​ជា​មួយ​នឹង​ជម្រើស​កម្មវិធី​របស់​ពួក​គេ​ ដើម្បី​ 
ធ្វើ​ការ​ "ចែក​ចាយ​លីនុច​" ។ល។ ហើយ​អ្នក​ទស្សនា​​ពាក់​កណ្តាល​បាន​ឈប់​ទស្សនា​
តំបន់​បណ្តាញ​នេះ​ហើយ​ ។ វា​មិន​មែន​ជា​តំបន់​បណ្តាញ​សម្រាប់​មនុស្ស​ដែលធ្លាប់​​បាន​ប្រើ​លីនុច​ជា​ប្រព័ន្ធ​ 
ប្រតិបត្តិការ​មេ​របស់​ពួកគេ​ទេ​ (លុះ​ត្រា​តែ​ពួក​គេ​ចង់​ជួយ​ឲ្យ​តំបន់​បណ្តាញ​នេះ​ប្រសើរ​ឡើង​) ។ សម្រាប់​ 
​​ហេតុ​ផលដូច​គ្នា​នេះ​ដែរ​ និង​សម្រាប់​ប្រយោជន៍ទូទៅ​នោះ ខ្ញុំ​នឹង​មិន​និយាយ​អំពី​ 
 BSDs ផ្សេង​ៗ​ និង​ភាព​ជាក់​ស្តែង​ដែល​ម៉ាស៊ីន​បម្រើ​​ <i>ធំៗ</i>​ជា​ច្រើន​​ដំណើរការ​​ជា​មួយ​ BSD មិន​មែន​លីនុច​ទេ​ ។</p> 
</li>

<li><p><b>សំណួរ​ ៖ ហេតុ​អ្វី​បាន​ជា​អ្នក​និយាយ​ថា​ ប្រព័ន្ធ​ប្រតិបត្តិការ​លីនុច​ប្រសើរ​ជាង​ប្រព័ន្ធ​ប្រតិបត្តិ​ការ​ផ្សេងៗ ​​? វា​អាស្រ័យ​ 
ទៅ​លើ​មនុស្ស​ដែល​ចង់​ប្រើ​វា​តែ​ប៉ុណ្ណោះ​​ ។</b></p>
<p>ចម្លើយ ៖ ពិត​ជា​អញ្ចឹង​មែន​ហើយ​  ខ្ញុំ​ពិត​ជា​គាំទ្រ​សម្តី​ហ្នឹង​ ។ ប៉ុន្តែ​សូម​យល់​ឲ្យ​បាន​ច្បាស់​ 
នូវ​​អ្វី​ដែល​ខ្ញុំ​ចង់​និយាយ​​នៅ​ទី​នេះ​សិន​ ៖ ១) ​​ឲ្យ​អ្នក​ប្រើ​វីនដូ​/Mac OS X ស្គាល់​ 
អ្វី​ៗ​​ដែល​មាន​នៅ​ទី​នោះ​សិន ។ ២) ផ្តល់​​នូវ​ហេតុផល​ពីរ ឬ​​បី​ថា​ ហេតុ​អ្វី 
បាន​ជា​លីនុច​គឺ​ជា​ប្រព័ន្ធ​​ប្រតិបត្តិការ​ដ៏​ល្អ​ និង​​ហេតុ​អ្វី​បាន​​ជា​វា ​ជា​​ជម្រើស​ដ៏​ល្អ​សម្រាប់​អ្នក​គ្រប់ពេល ។​ 
តាម​ពិត​ទៅ​ ឈ្មោះ​របស់​តំបន់​បណ្តាញ​មាន​អត្ថន័យ​ច្បាស់លាស់​ជាង​នេះ​ 
ទៅ​ទៀត​ ប៉ុន្តែ​ អេ​ ! តើ​ខ្ញុំ​គួរ​តែ​ទិញ <tt>​whylinuxmaybebetterinmanycases.net ឬ​អត់​ ?</tt> </p>

<p>ខ្ញុំ​មិន​មែន​ជា​អ្នក​ជំនាញ​ខាង​លីនុច​ទេ ហើយ​ក៏មិន​មែន​ជា​មេ​ដឹក​នាំ​និកាយ​សាសនា​ដែរ​  ហើយ​ខ្ញុំ​ក៏​មិន​ចង់​ 
និយាយ​បញ្ចុះ​បញ្ចូល​អ្នក​ណា​ដែរ​ ៖ ខ្ញុំ​គ្រាន់​តែ​ជា​អ្នក​ប្រើ​ និង​ជា​អ្នកអភិវឌ្ឍ​​​លីនុចដ៏​រីក​រាយ​ម្នាក់​ 
ដែល​កំពុង​តែ​ព្យាយាម​ធ្វើ​ឲ្យ​មនុស្ស​គ្រប់​រូប​ស្គាល់​អំពី​លីនុចកាន់​តែ​ច្បាស់ប៉ុណ្ណោះ​​​ ។</p>

</li>

<a name="gnu"><li><p><b>សំណួ​រ ៖ វា​​ជា​ GNU/លីនុច​ មិន​មែន​លីនុច​ឥត​បានការ​នោះ​ទេ​ !</b></a></p>

<p>ចម្លើយ​ ៖ នៅ​លើ​តំបន់​បណ្តាញ​សម្រាប់​អ្នក​ប្រើ​លីនុច​កម្រិត​ខ្ពស់​ សេចក្តី​លម្អិត​ដូច្នេះ​អាច​នឹង​​ជា​បញ្ហា​
បើ​ទោះ​បី​យ៉ាង​ណា​ ខ្ញុំ​ចង់​ឲ្យ​រឿង​នេះ​មាន​ភាព​ធម្មតា​ដដែល​ ។ មនុស្ស​គ្រប់​រូប​ធ្លាប់​ឮ​​អំពី​ "លីនុច​" មិន​មែន​ 
"GNU/លីនុច​" ទេ ហើយ​ការ​ជជែក​ដេញ​ដោល​គ្នា​បែប​នេះ​ឯង ​​ដែល​អាច​ជា​បញ្ហា​មួយ​
ដែល​ធ្វើ​ឲ្យ​មនុស្ស​ "ធម្មតា" មិន​អាច​យល់​បាន​អំពី​រឿង​ទាំង​អស់​នេះ​ ។ 
ចំពោះ​​ហេតុ​ផល​ដូច​គ្នា​នេះ​ដែរ​ ខ្ញុំ​សរសេរ​ថា​ "OpenOffice" ជំនួស​ឲ្យ​ 
"OpenOffice.org" ។ល។</p>

<p>ហើយ​ម្យ៉ាង​ទៀត​  "សំណួរ ៖" នេះ​ មិន​មែន​ជា​សំណួរ​​ទេ ដោយ​សារតែ​វា​មិន​មាន​ 
សញ្ញា​សួរ (?) ប៉ុន្តែ​ទោះ​យ៉ាង​ណា​ ​ខ្ញុំ​បាន​សរសេរទាំង​សំណួរ​​ និង​ 
ចម្លើយអស់​ហើយ​​... អូមែន​!​​ ខ្ញុំ​ពិត​ជា​ឡប់មែន​ ។</p>

</li>

<li><p><b>សំណួរ​ ៖ សំឡាញ់ ភាសា​អង់គ្លេស​របស់​ឯង​អន់​ណាស់​ ​។</b></p>
<p>ចម្លើយ​ ៖ ខ្ញុំ​ដឹង​ ។ ហើយ​ឥឡូវ​ខ្ញុំ​កំពុងតែ​ព្យាយាម​ហើយ​ ។ សូម​មេត្តា​ជួយ​ណែ​នាំ​ផង ។</p>
</li>

<li><p><b>សំណួ​រ​ ៖ អ្នក​ហាក់​ដូច​ជា​ចាប់​អារម្មណ៍​តែ​លើ​ GNOME និង​ Ubuntu ប៉ុណ្ណោះ ។ តែ​ដូច​ជា​ពុំសូវ​ 
ចាប់​អារម្មណ៍​លើ​ KDE និង​ការ​​ចែក​ចាយ​ផ្សេង​ទៀត​សោះមែន​ទេ​​ ?</b></p> <p>ចម្លើយ​ ៖ មិន​មែន​ 
អញ្ចឹង​ទេ ។ ខ្ញុំ​​ពិត​ជា​ចាប់​អារម្មណ៍​ ហើយ​ក៏​បាន​ប្រើ​កម្មវិធី​ KDE ជា​ច្រើន​ទៀត​ផងដែរ​​ (បើ​គេ​អាច​បញ្ចូល​ GNOME 
​​នឹង​ KDE បាន​ ដោយ​ដាក់​បញ្ចូល​​កម្មវិធីរបស់​​ KDE ក្នុង​ GNOME 
និង​តាម​វិធី​ផ្សេង​ៗ​​ទៀត​​ ខ្ញុំ​ពិត​ជា​សប្បាយ​ចិត្តណាស់​) ។ រូប​ថត​អេក្រង់​របស់​ខ្ញុំ​ 
ភាគ​ច្រើន​បង្ហាញ​អំពី​ Ubuntu ដោយ​សារតែ​ខ្ញុំជា​អ្នក​​ប្រើ​ និង​អភិវឌ្ឍ​ការ​ចែក​ចាយ​​នោះឯង ។ 
មិន​ចាំ​បាច់​និយាយ​ច្រើន​ទេ​ ផ្ញើ​រូប​ថត​អេក្រង់​ផ្សេង​ទៀត​ឲ្យ​ខ្ញុំ​មក​បាន​ហើយ​ ។ អ្នក​ប្រហែល​ជា​ 
សង្កេត​ឃើញ​​ហើយ​ថា ខ្ញុំក៏​មាន​កម្មវិធី​ទាក់​ទង​នឹង​ AmaroK ដែរ មិន​បាច់​ក្រែង​ចិត្ត​អី​ទេ​ អ្នក​អាច​ផ្ញើ​យោបល់​ 
បន្ថែម​ទាក់​ទង​នឹង​កម្មវិធី​ KDE (និង​ GNOME!) មក​កាន់​ខ្ញុំ​បាន​ ។</p> </li>

<li><p><b>សំណួរ​ ៖ ស្លាប់​ហើយ​ លោក​ដឹង​អំពី​លីនុច​ដែរ​ឬ​​ទេ​ ?</b></p> 
<p>ចម្លើយ​ ៖ ប្រហែល​ជា​ដឹង​មិន​សូវ​ច្រើន​ប៉ុន្មាន​ទេ ​! ខ្ញុំ​ជា​សមាជិក​របស់​ Ubuntu ខ្ញុំ​ប្រើ​ 
លីនុច​តាំង​ពី​ឆ្នាំ​ ១៩៩៨ និង​បាន​សរសេរ​សៀវ​ភៅតូចៗ​ (ជា​ភាសា​បារាំង​) ស្តី​អំពី​ 
កម្មវិធី​ប្រភព​កូដ​ចំហ​ (Firefox លីនុច​ ។ល។) ខ្លះៗ​ផង​ដែរ ។ ប៉ុន្តែ​ខ្ញុំ​កំពុង​តែ​ព្យាយាម​ដោះ​ស្រាយ​ 
អំពី​រឿង​នោះ ហើយ​ខ្ញុំ​ទើប​តែ​បាន​បញ្ជា​ទិញ​សៀវ​ភៅ​​​ "ស្វែង​យល់​អំពី​ខឹណែល​របស់​លីនុច​"  (​ពេលអ្នក​ចាប់​ផ្តើម​​​អាន​
អំពី​រឿង​នេះ  ខ្ញុំ​ប្រហែល​ជា​អាន​ចប់​បាត់​ហើយ​ ហើយ​នឹង​អាច​យល់រឿង​​ទាំង​អស់​ 
អំពី​លីនុចទៀត​ផង​​ ហើយ​ខ្ញុំ​ចង់​បង្កើត​កំណែ​ដោយ​ខ្លួន​ឯង​ផ្ទាល់​ ដែល​ខ្ញុំ​អាច​នឹង​ 
ដាក់​ឈ្មោះ​​​ថា​ "Manux" -- មែន​ហើយ​ ប្រហែល​ជា​ទៅ​មិន​រួច​ទេ​) ។</p> </li>

<a name="gaming"><li><p><b>សំណួ​រ ៖ អ្នក​និយាយ​ថា​ អ្នក​លេង​ល្បែង​មិន​គួរ​ប្តូរទៅប្រើ​​លីនុច​ទេ 
ប៉ុន្តែ​អ្នក​មិន​ទាន់​ដឹង​អំពី​ Wine និង​ Cedega ទេឬ ? ពួក​វា​ដំណើរ​ការ​បាន​យ៉ាង​រលូន​ជា​មួយ​នឹង​ល្បែង​ 
មួយ​ចំនួន​របស់​វីនដូ ។</b></p><p>ចម្លើយ​ ៖ ខ្ញុំ​យល់​ស្រប ​ដំណោះ​ស្រាយ​កម្មវិធី​ 
ផ្សេង​ៗទៀត​អាច​​ធ្វើ​ឲ្យ​​​ល្បែងដែល​ដំណើរ​ការ​លើ​វីនដូអាច​ដំណើរ​ការ​នៅ​ក្នុង​លីនុច​បាន​កាន់​តែ​ងាយ​ស្រួលជាង​មុន​ផង​ដែរ​ ។ 
 វា​ជា​ដំណោះ​ស្រាយ​ដ៏​ល្អ​សម្រាប់​អ្នក​លេង​ល្បែងធម្មតា​ ។ ទោះ​យ៉ាង​ណា​ សូម​ចំណាំ​ថា​
ខ្ញុំ​ធ្លាប់​បាន​ប្រើ​ឃ្លា​ថា​ "hardcore gamers"  គឺ​ជា​អ្នក​លេង​ដែល​ទិញ​ 
ល្បែង​ដែល​ទើប​តែ​ចេញ​ថ្មីៗ​ និងធ្វើ​ឲ្យ​ស៊ីភីយូ​របស់​ពួក​គេ​ដំណើរ​ការលើស​​ក្នុង​កម្រិតមេហ្គាហឺត​​​ ដើម្បី​ទទួល​បាន​នូវ​ប្រតិបត្តិការ​​ដ៏​ល្អ  តែ​ខ្ញុំ​សង្ស័យ​ថា​ 
វា​អាច​នឹង​ធ្វើ​ឲ្យ​មាន​បញ្ហា ។</p></li>

<a name="distros"><li><p><b>សំណួរ ៖ សូម​បន្ថែម​ការ​ចែក​ចាយ​​ XYZ  របស់​លីនុច​ទៅ​កាន់​ទំព័រ​របស់​អ្នក​ នៅ​ពេល​អ្នក​កំពុង​​​​ដំឡើង​លីនុច ។</b></p><p>
ចម្លើយ ៖ មាន​ការ​ចែក​ចាយ​ច្រើន​ណាស់​នៅ​ទីនោះ  ហើយ​សំណុំ​រងណា​មួយ​​ដែល​មាន​ការ​ដាក់​កំណត់​​​ប្រហែល​ជា​មិន​អាច​ធ្វើ​ឲ្យ​មនុស្ស​គ្រប់​រូប​ស្កប់​ស្កល់​បាន​ទេ​ ។ 
សម្រាប់​មនុស្ស​ដែល​ចង់​សាក​ល្បង​ប្រើ​លីនុច​ បាន​យល់​ច្រលំថា​មាន​ "កំណែ​/លក្ខណៈ​" មួយ​ចំនួន​របស់​​វា​ ។ ខ្ញុំ​សម្រេច​ចិត្ត​ថា​នឹង​និយាយ​តែ​ ៤ ក្នុង​ចំណោម​ពួក​វា​ដែល​កំពុង​តែ​​​ពេញ​និយម​ ហើយ​ខ្ញុំ​គិត​ថា​វា​ជា​ជម្រើស​ដែល​សម​ហេតុ​ផល​បំផុត​ ។</p></li>

<li><p><b>សំណួរ​ ៖ អេ!  តើ​អ្នក​មិន​មែន​ជា​មនុស្ស​ដែល​ងប់​ងល់នឹង<a 
href="http://www.manucornet.net/pcjacking">​​PCJacking​</a>ទេ​ឬ ?</b></p>
<p>​ចម្លើយ​ ៖ ពិត​ជា​អញ្ចឹង​ហើយ​ ។</p>
</li>

<li><p><b>សំណួរ​ ៖ អេ! តើ​អ្នក​​មិន​មែន​ជា​មនុស្ស​ដែល​ងប់​ងល់​នឹង<a 
href="http://www.manucornet.net/Informatique/Gimp_Texturize.php"> GIMP-Texturize ទេឬ ?</a> 
</b></p>
<p>ចម្លើយ​ ៖​ មែន​ ! លោក​និយាយ​ត្រូវ :) ប៉ុន្តែ <a href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a> ក៏​បានធ្វើ​​ការងារ​នោះ​ពាក់​កណ្តាល​ដែរ
មែន​ហើយ មាន​អី​ទៀត​ទេ ។ សំណួរ​បន្ទាប់​ទៀត ។​​ </p>
</li>

<li><p><b>សំណួរ​ ៖ តើ​អ្នក​ទាំង​អស់​គ្នា​មិន​មែន​ជា​អ្នក​ងប់​ងល់​នឹង<a href="http://code.google.com/summerofcode.html">Summer code របស់​ហ្គូហ្គល</a> 
ដែល​ជា​អ្នក​លួច​ចូល​​កុំ​ព្យូទ័រ​ ៤០០ នាក់​ក្នុង​ចំណោម​អ្នក​លួច​ចូល​កុំព្យូទ័រ​ ៩០០០ ដែល​បាន​ជ្រើស​ទេ​ឬ ?</a></b></p> 
<p>ចម្លើយ​ ៖ មែន​ ។ ប៉ុន្តែខ្ញុំ​​ទើប​តែ​មាន​សំណាង​ ៖ ខ្ញុំ​បាន​ផ្ញើ​ការ​ស្នើ​គម្រោង​ ៨០០០ ក្នុង​ចំណោម​ ៩០០០ 
ហើយ​មាន​តែ​គម្រោង​មួយ​​ប៉ុណ្ណោះ​ដែល​​​ត្រូវ​បាន​ទទួល​យក​ ។ មែ​ន​ហើយ​ ខ្ញុំ​មាន​សំណាង​ដល់​ទៅ​ពីរ​ដង​ឯណោះ  (ឆ្នាំ ២០០៥ និង ២០០៦) ។ ឆ្នាំ​ក្រោយ​ខ្ញុំ​នឹង​ 
បើក​ប្រភព​កម្មវិធី​បង្កើត​គម្រោង​ដោយ​ស្វ័យ​ប្រវត្តិ​របស់​ខ្ញុំ​ផ្ទាល់​តែ​ម្តង​ ។</p> </li>

<li><p><b><a name="help">សំណួរ ៖ សួស្តី! ខ្ញុំ​មិន​អាច​ធ្វើ​ឲ្យ​ XYZ ធ្វើ​ការ​នៅ​លើ​លីនុច​បាន​ទេ​ ។ តើ​លោក​អាច​ជួយ​ខ្ញុំ​បាន​ទេ ?</a></b></p>

<p>ចម្លើយ​ ៖ សូម​អភ័យ​​ទោស​ ប៉ុន្តែ​មិន​គួរ​ចាត់​ទុក​អាសយដ្ឋាន​អ៊ីមែល​របស់​ខ្ញុំ​ដូច​ជា​នាម​ក្លែង​ក្លាយ​ដែល​
គាំ​ទ្រ​លីនុច​ដែល​គ្មាន​ដែន​កំណត់​នោះ​ទេ​ :-) ក៏​ដូច​ជា​មនុស្ស​​ដទៃ​ទៀត​ដែរ​ ខ្ញុំ​មាន​កិច្ច​ការ​​ច្រើន​ដែល​ត្រូវ​ធ្វើ​ ហើយ​នៅ​ពេលណា​
ដែល​ស្បើយ​ការងារ ខ្ញុំ​នឹង​មាន​​ពេល​វេលា​ដើម្បី​​ជួយ​អ្នក​ ខ្ញុំ​ជឿ​ថា​​មនុស្ស​ជា​ច្រើន​
ដែល​ស្ថិត​នៅ​ក្នុង​វេទិកា​ ឬឆានែល  IRC នឹង​រីករាយ​​ក្នុង​ <a href="http://www.whylinuxisbetter.net/items/help/index.php">ការ​ឆ្លើយ​សំណួរ​របស់​អ្នក !</a> ហើយ​ការ​ស្វែង​រក​តាម <a href="http://www.google.com">ហ្គូហ្គល</a>​ជា​ទី​ន្លែង​ដែល​ល្អ​បំផុត​ដើម្បី​ចាប់​ផ្តើម​ជា​និច្ច ។
 <a href="http://www.google.com"></a> 
</p></li>

<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>

</body>
</html>
