<?php require("entete.php"); ?> <?php require("base.php"); ?>

<div id="corps">

<h2>វិធី​បកប្រែ​តំបន់បណ្ដាញ​នេះ</h2>

<ol>

<li>ផ្ញើ​អ៊ីមែល​មក​ខ្ញុំ​តាម​រយៈ​​​​អាសយដ្ឋាន ideas [at] whylinuxisbetter [dot] net ដើម្បី​ប្រាក​ថា​ មិន​ទាន់​មាន​អ្នក​ណា​​បកប្រែ​ភាសា​នេះ​នៅ​ឡើយ​ទេ ។</li>

<li>ជ្រើស​​​​អក្សរ​កាត់​ខ្លី ហើយ​មាន​តែ​មួយ​គត់​សម្រាប់​ភាសា​របស់​អ្នក (ឧទាហរណ៍ "km" សម្រាប់​ភាសា​ខ្មែរ, "ru" 
សម្រាប់​ភាសា​រុស្ស៊ី ) ។ យើង​នឹង​ហៅ​អក្សរ​កាត់នេះ​ថា "lang" សម្រាប់​ការ​បង្រៀន​នេះ បន្ទាប់មក​ទាញយក ហើយ​ស្រង់ចេញ​ពី​​ <a 
href="http://www.manucornet.net/pub/www.whylinuxisbetter.net.tgz"></a> ។</li>

<li>ត្រូវ​ប្រាកដ​ថា​ អ្នក​ត្រូវ​ប្រើកម្មវិធី​កែសម្រួល​អត្ថបទដ៏​​សាមញ្ញា (gedit នៅ​លីនុច ឬ​ Notepad នៅ​ក្នុង​វីនដូ) ហើយ​អ្នក​ប្រាកដថា អ្នក​បើក​​ឯកសារ ហើយ​រក្សាទុក​ក្នុងការ​អ៊ីនកូដ 
UTF-8 ។ ជា​មួយ​នឹង​កម្មវិធី​កែសម្រួល​អត្ថបទ​នេះ បង្កើត​ឯកសារ​មួយ​ដែល​មាន​ឈ្មោះ​ថា title_lang.txt នៅ​ទីតាំង​ root នៃ​ប័ណ្ណសារ​ដែល​បានពង្រីក ហើយ​ដាក់​​ចំណង​ជើង​របស់​តំបន់បណ្ដាញ​នេះ​ក្នុង​វា ។</li>

<li>ចូល​ទៅ​ក្នុង​ថត​រង "items" ។ នៅ​ទីនេះ អ្នក​អាច​​ឃើញ​ថត​សម្រាប់​បកប្រែ​អត្ថបទ​របស់​តំបន់​នេះ​ ។ នៅ​ក្នុង​ថត​នីមួយៗ

<ul>

<li>​ចម្លង​ឯកសារ​ដែលមាន​ឈ្មោះ index.php ហើយ​ដាក់​ឈ្មោះ index_lang.php&nbsp; ។</li>

<li>បើក​ឯកសារ​ដែល​បាន​បង្កើត​ថ្មីៗ រក​អត្ថបទ​ភាសា​អង់គ្លេស ហើយ​ជំនួយ​ដោយ​ការ​បកប្រែ​​របស់​អ្នក (អ្នក​មិនចាំបាច់​យល់ HTML ឬ PHP នោះ​ទេ គ្រាន់​តែ​ព្យាយាម​រក្សាទុក​ផ្នែក​ដែល​អ្នក​មិន​យល់​​​ ឲ្យ​នៅ​ដដែល​បាន​ហើយ) ។ </li>

</ul>
</li>

<li>ធ្វើ​ដូច​គ្នា​ចំពោះ​ឯកសារ​ផ្សេងៗ​ទៀត​ដែល​មាន​នៅ​ក្នុង​ថត "stick_to_windows" និង 
"switch" ។</li>

<li>នៅ​ក្នុង​ប័ណ្ណសារ ចម្លង​ឯកសារ index.php មេ​ទៅ​ជា 
index_lang.php ។ វា​មាន​មួយ​បន្ទាត់​សម្រាប់​​បញ្ចូល​ "ធាតុ" នីមួយៗ ៖ សម្រាប់​​បន្ទាត់​ទាំង​នេះ​នីមួយៗ ជំនួស​ខ្សែអក្សរ​ទទេ "" ដោយ​​អក្សរ​កាត់​ភាសា​របស់​អ្នក​ដោយ​មាន​សញ្ញា (_) ៖ "_lang" ហើយ​បកប្រែ​ចំណង​ជើង​នៃ​ធាតុ​នេះ ។</li>

<li>បង្ហាប់​ប័ណ្ណ​សារ​ឡើង​វិញ (វា​កាន់​តែ​ប្រសើរ​ ប្រសិនបើ​អ្នក​អាច​យក​ឯកសារ​ដែល​អ្នក​មិន​ប៉ះពាល់​ចេញ ដាក់​តែ​ការ​បកប្រែ​ថ្មីប៉ុណ្ណោះ ហើយ​​គ្មាន​កំហុស) បន្ទាប់​មក​ផ្ញើ​​វា​មក​ខ្ញុំ​តាមរយៈ​អ៊ីមែល
(ដូច​អាសយដ្ឋាន​ខាង​លើ) ។ នៅ​ក្នុង​អ៊ីមែល​នេះ សូម​ដាក់​ឈ្មោះ​ ដែល​អ្នក​ចង់​ឲ្យ​បង្ហាញ​ និង​​ទំព័រ​បណ្ដាញ​របស់​អ្នក ដែល​ខ្ញុំ​អាច​តភ្ជាប់​ ប្រសិនបើ​មាន ។</li>

<li>មើល​ការ​បក​ប្រែ​របស់​អ្នក​នៅ​ក្នុង​តំបន់បណ្ដាញ ដែល​មាន​ឈ្មោះ​របស់​អ្នក​​នៅ​ក្នុង​ទំព័រ​ដំបូង​​នៃ​ភាសា​របស់​អ្នក និង​សូម​ទទួល​នូវ​​​ការ​អរគុណ​យ៉ាង​ជ្រាលជ្រៅ​​​អំពី​ខ្ញុំ និង​​ពី​អ្នក​ដទៃ​ទៀត !!</li>

</ol>

សូម​អរគុណ​ច្រើន !!

</div>
</body>
</html>
