<?php require("entete.php"); ?> <?php require("base.php"); ?>

<div id="corps">

<h2>이 웹사이트 번역하기</h2>

<ol>

<li>하고자 하는 번역을 다른 사람이 이미 하고 있는지 Ideas [at] whylinuxisbetter [dot] net 으로 이메일을 보내서 확인해 주세요.</li>

<li>당신의 언어를 상징하는 고유하고 짧은 단축어구를 골라주세요(예를 들면, 러시아어는 "ru", 세르비아어는 "ser" 이런 식으로요).  이 지침서에서는 단축어구를 "lang" 이라고 예를 들어 보겠습니다. 이제 <a href="http://www.manucornet.net/pub/www.whylinuxisbetter.net.tgz">이 자료</a>를 다운로드하고 압축을 풀어주세요.</li>

<li>꼭 간단한 문서편집기를 사용해 주셔야 하고(리눅스에서라면 gedit이 좋겠고, 윈도우즈에서라면 notepad가 좋겠네요), UTF-8엔코딩을 이용하여 파일을 열고 저장해 주셔야 합니다. 압축이 풀린 곳의 최상위 폴더에 제시된 편집기를 이용하여 title_lang.txt라는 파일을 만들고 이 웹사이트의 제목을 번역하여 넣어주시면 됩니다.</li>

<li>"items"라는 폴더로 가세요. 그 폴더 안에는 이 웹사이트의 내용들이 담긴 폴더들이 있을 겁니다.  각각의 폴더에서

<ul>

<li>index.php파일을 index_lang.php파일로 이름 바꿔 복사해 주세요&nbsp;.</li>

<li>새로 생성된 파일을 열어서 영어로 쓰여있는 본문내용을 번역한 내용으로 바꿔주세요. (HTML이나 PHP를 모르셔도 됩니다. 잘 모르시는 부분은 그냥 내버려두시면 됩니다.)</li>

</ul>
</li>

<li>"stick_to_windows"폴더와 "switch"폴더도 마찬가지로 해 주세요.</li>

<li>가장 상위 폴더에서 index.php파일을 index_lang.php로 이름 바꿔 복사해 주세요. 이 파일안에는 "items" 폴더에 들어있는 하위 폴더들의 제목이 적혀 있습니다: 각각의 제목들 옆에 ""처럼 빈 따옴표가 보일 텐데요. 그 안에 당신의 언어 접미사에 언더바를 붙여서 집어넣어 주세요: "_lang". 그리고 제목을 번역해서 바꿔주시고요.</li>

<li>파일을 다 변경하셨으면 다시 압축하여(손대지 않으신 파일은 빼시고, 번역하여 변경하신 파일만 넣어주시는 게 제일 좋습니다), 위에 제시된 이메일 주소로 보내주세요. 이메일에는 번역된 홈페이지에 나타날 당신의 닉네임과 링크될 당신의 홈페이지 주소(만약 있다면)를 적어주세요.</li>

<li>이제 당신이 작업한 페이지들과 함께 당신의 이름이 위에 적혀있는 것을 감상하시고, 저의 무한한 감사를 받아주세요! 그리고 같은 언어를 쓰시는 분들의 감사들도 함께 받아주세요 !!</li>

</ol>

정말 감사합니다!!

</div>
</body>
</html>
