<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" class="rtl" dir="rtl">

‏<h2>נמאס לכם להפעיל את המחשב מחדש כל הזמן?</h2>

‏<p>האם שדרגתם זה עתה דבר אחד או שניים קטנים במערכת ה־Windows שלכם באמצעות "Windows Update"? נא להפעיל מחדש.
האם התקנתם תכנית חדשה זה עתה? נא להפעיל מחדש. האם קיבלתם את התחושה שהמערכת שלכם אינה יציבה? נסו להפעיל מחדש, קרוב לוודאי שהכל יעבוד יותר טוב אחרי ההפעלה מחדש.</p>

‏<p> Windows 
תמיד תבקש מכם להפעיל את המחשב מחדש, ובקשה זו עלולה לפעמים ממש להרגיז (למשל, אם במקרה אתם באמצע הורדת קובץ כבד ואינכם רוצים להפריע לתהליך רק מפני שעדכנתם מספר רכיבים במערכת שלכם).
אבל אפילו אם לחצתם על "הפעלה מחדש מאוחר יותר", Windows בכל זאת ממשיכה לנדנד לכם כל 10 דקות או משהו כזה כדי להזכיר לכם שעליכם להפעיל את המחשב מחדש. ואם במקרה לא הייתם ליד המחשב ולא ראיתם את השאלה, המחשב ישמח להפעיל את עצמו מחדש באופן אוטומטי עבורכם.  שלום ולא להתראות, הורדה ענקית.</p>

<p>בעקרון, לינוקס אינה צריכה להפעיל את עצמה מחדש.
לא משנה אם אתם רק מתקינים תכנה חדשה (אפילו יישומים גדולים מאוד) או מבצעים שדרוג שגרתי למערכת שלכם, לא תתבקשו להפעיל את המחשב מחדש.
הפעלה מחדש נדרשת רק אם עודכנה חלק מליבת המערכת, וגם זה קורה רק פעם במספר חודשים.</p>

<p>יודעים מה זה שרתים?
אלו המחשבים הגדולים שעונים לכם כשאתם מבקשים עמודי אינטרנט, והם אלו ששולחים את המידע לדפדפן שלך.
רובם מריצים לינוקס ומכיוון שהם צריכים להיות זמינים כל הזמן (גולש עלול להופיע בכל רגע), הם לא מופעלים מחדש לעתים קרובות (השירותים אינם זמינים כשהמערכת מאתחלת את עצמה).
 למעשה, רבים מהם לא הופעלו מחדש משך <b>שנים רבות</b>.
לינוקס יציבה ופועלת נהדר ללא צורך בהפעלה מחדש כל הזמן.</p>

<p>קרוב לוודאי שלא תשאיר את מחשבך דולק למשך שבועות רבים אבל הנקודה היא:
המערכת לא תטריד אתכם באיתחולים כל הזמן.</p>

<img src="Images/reboot_all_the_time_thumb.png" />

</div>
<?php require("../../license_he.php");?>
</body>
</html>
