

---
lang: ua
title:  Встанови Linux (не видаляючи Windows)</h2>

<p align="center">Переклад з німецької Шевченко Жанни та Загородньої Тетяни</p>

<p>Отже, ти вирішив  перейти на  Linux. Ти не пожалкуєш!</p>

<p>Якщо ти хочеш зберегти Windows на своєму комп’ютері (що я раджу на той випадок, якщо ти зміниш свою думку або якщо є речі, які ти можеш робити лише за допомогою  Windows), то місце на твоєму жорсткому диску буде поділено між Windows і Linux.</p>

<p>Перш за все ти повинен зробити копії усіх своїх даних. Це дуже важливо. Ніколи не знаєш на 100%, що може трапитись. Справді, я не жартую. Збережи свої дані, візьми CD або DVD, жорсткий диск або ще щось, але збережи свою роботу!</p>
<p>Після цього ти повинен дефрагментувати свій жорсткий диск. Зараз всі твої дані будуть розкидані скрізь по жорсткому диску. (Windows працює з твоїми документами не найкращим чином,  Linux - набагато краще).Після дефрагментації (це може тривати кілька годин в залежності від розміру твого жорсткого диску) всі без виключення файли будуть зібрані на початку диску (його можна уявити як довгу прямолінійну стрічку з початком та кінцем). Коли твої файли будуть там зібрані, Linux без жодних проблем розділить твій жорсткий диск на 2 частини (звісно, віртуально) і самостійно встановиться на другій половині. </p>

<p>Добре, ти готовий до інсталяції, тепер ти мусиш ще вирішити, який Linux-дистрибутив ти хочеш мати. Існує цілий ряд різних дистрибутивів на будь-який смак, виготовлених різними організаціями та підприємствами, оснащених різноманітними пакетами програмного забезпечення, з різним виглядом та системою керування і т.д. Все це - Linux, але просто в різних "інтерпретаціях". Тут не може бути однозначного рішення – кожен вибирає на свій смак (хоча багато людей охоче аргументують, чому саме їх дистрибутив найкращий). Ось список з 4 найпопулярніших дистрибутивів, представлених на <a 
href="http://www.distrowatch.com">distrowatch.com</a> :</p>

<? make_distros_table() ?>

<p>Якщо ти вже вибрав дистрибутив, завантаж CD-образ (деколи їх може бути кілька), запиши на диск (слідкуй за тим, щоб вибрати правильний спосіб запису для Image-CD) , встав його в дисковод і перезавантаж комп’ютер. Твій ПК повинен завантажитися із CD; якщо не вийде, твої  Вios-установки містять помилки (дивись розділ "Випробуй Linux").</p>

<p>Потім тобі потрібно лише слідувати вказівкам на екрані, вони в більшості випадків дуже прості.</p>

<p><b>Насолоджуйся  роботою на Linux!</b></p>

