

---
lang: bg
title: Инсталирайте Линукс</h2>

<p>Вие решихте да преминете към Линукс. Няма да съжалявате!</p>

<p>Ако решите да запазите Windows (което ви препоръчвам, в случай че си промените мнението или намерите нещо, което може да правите само с Windows), Windows ще трябва да дели диска с Линукс. Тогава всеки път, когато се стартира компютърът, ще може да избирате между Windows и Линукс.</p>

<p>Първо трябва да <b>направите резервно копие на всичките си данни</b>. Това е от изключителна важност. Никога не се знае какво може да се обърка. Не, наистина не се шегувам. Направете резервно копие, осигурете си празни CD, празни DVD, друг твърд диск, каквото и да е, но направете резервно копие на данните си.</p>

<p>След това трябва да дефрагментирате диска си. В момента, данните ви са разпръснати навсякъде (Windows не управлява това много добре, Линукс се справя много по-добре). След дефрагментирането (това може да отнеме няколко часа, в зависимост от големината на диска) всичките данни ще са събрани в началото на диска (мислете за него като за дълга, права лента с начало и край). Ако данните са ви събрани там, Линукс няма да има никакъв проблем да раздели (виртуално, разбира се :) ) диска ви и да се инсталира на втората част.</p>

<p>Всичко сте подготвил, сега всичко, което остава, е да изберете коя Линукс дистрибуция искате. Линукс идва с много различни варианти, създадени от различни организации или компании, с различен комплект софтуер, различен изглед и усещане и т.н. Всички те са Линукс, но с различна интерпретация. Няма категоричен избор и тук наистина не мога да ви помогна (всъщност, много хора обичат да се аргументират, защо точно тяхната дистрибуция е най-добрата). Въпреки това, има четири най-популярни дистрибуции, класирани според <a 
href="http://www.distrowatch.com">distrowatch.com</a> :</p>

<? make_distros_table() ?>

<p>Когато сте избрал дистрибуция, свалете CD изображението(та), запишете го(ги) на празен(ни) CD, сложете първият диск в CD устройството и рестартирайте. Компютърът ви трябва да използва CD за стартиране; ако не става, значи не са правилни BIOS настройките (вижте секцията "Опитайте Линукс").</p>

<p>След това просто следвайте екранните инструкции: те са доста прости и последователни през повечето време!</p>

<p><b>Приятно изкарване с Линукс!</b></p>

</div>
