

---
lang: el
title: Εγκαταστείστε το Linux</h2>

<p>Εντάξει, αποφασίσατε λοιπόν να εγκαταστήστε το Linux. Δεν θα το μετανιώσετε!</p>

<p>Αν θέλετε να κρατήσετε τα Windows στον υπολογιστή σας (κάτι που συνιστώ, 
σε περίπτωση που αλλάξετε γνώμη, ή αν βρείτε εργασίες που μπορείτε να κάνετε μονάχα
με τα Windows), τα Windows θα χρειαστεί να μοιραστούν τον σκληρό δίσκο με το Linux. 
Τότε, κάθε φορά που εκκινείτε τον υπολογιστή, θα σας επιτρέπει να επιλέξετε μεταξύ
Windows και Linux. </p>

<p>Πρώτα θα πρέπει να <b>κάνετε backup όλα τα δεδομένα σας</b>. Αυτό είναι πολύ 
σημαντικό. Δεν ξέρετε τι μπορεί να πάει στραβά. Πραγματικά, δεν αστειεύομαι.
Κάνετε backup τα δεδομένα σας, σε CD, DVD, έναν άλλο σκληρό δίσκο, δεν έχει σημασία, 
αλλά κάνετε backup.</p>

<p>Έπειτα θα πρέπει να κάνετε defragment στον σκληρό σας δίσκο. Τα δεδομένα σας 
είναι σκορπισμένα παντού (τα Windows δεν χειρίζονται πολύ καλά αυτό το θέμα, 
το Linux τα πάει πολύ καλύτερα). Μετά το defragmenting (αυτό μπορεί να κρατήσει 
για ώρες, ανάλογα με το μέγεθος του δίσκου σας), όλα τα δεδομένα θα έχουν 
συγκεντρωθεί στην αρχή του δίσκου (φανταστείτε μια μακριά ταινία, με αρχή και τέλος).
Αν τα δεδομένα σας συγκεντρωθούν εκεί, το Linux δεν θα έχει κανένα πρόβλημα 
να χωρίσει (εικονικά, φυσικά :) ) τον δίσκο σας στα δύο, και να εγκατασταθεί 
στο δεύτερο μέρος. </p>

<p>Εντάξει, είστε έτοιμος/-η, τώρα πρέπει απλά να επιλέξετε ποια διανομή του Linux 
θέλετε. Το Linux έχει διάφορες "γεύσεις", φτιαγμένες από διάφορες εταιρείες/οργανισμούς 
με διαφορετικές συλλογές λογισμικού, διαφορετική αισθητική, κλπ. 
Είναι όλες Linux, αλλά με διαφορετικές "ερμηνείες". Δεν υπάρχει προφανής επιλογή, 
και δεν μπορώ να σας βοηθήσω σε αυτό το θέμα (αλήθεια, υπάρχουν πολλοί άνθρωποι που 
καυχιούνται ότι η διανομή τους είναι η καλύτερη). Πάντως αυτές είναι οι τέσσερις πιο 
δημοφηλείς διανομές, ταξινομημένες από το <a 
href="http://www.distrowatch.com">distrowatch.com</a> :</p>

<? make_distros_table() ?>

<p>Όταν επιλέξετε διανομή, κατεβάστε το(α) CD(s) image(s), 
γράψτε τα σε άδειο(α) CD(s), εισάγετε το πρώτο CD στον οδηγό CD και επανεκκινήστε. 
Ο υπολογιστής σας θα πρέπει να χρησιμοποιήσει το CD για την εκκίνηση. Αν όχι, 
οι ρυθμίσεις του BIOS είναι προβληματικές (δείτε το κεφάλαιο "Δοκιμάστε το Linux").</p>

<p>Μετά από αυτό, ακολουθήστε τις οδηγίες στην οθόνη : είναι συνήθως αρκετά απλές και εύκολες !</p>

<p><b>Καλή διασκέδαση με το Linux!</b></p>

</div>
</body>
</html>
