

---
lang: cn
title: 安装Linux</h2>

<p>好的，您已经决定改换Linux最为您的操作系统了。您绝对不会后悔的。</p>

<p>如果您想要保留您的Windows在电脑商（这也是我所推荐的，以防您改变主意，或者以防您
找不到可以代替Windows平台下的对应软件），Windows需要和Linux共有硬盘。这样，每次您的
计算机启动，都会要求您选择启动Linux还是Windows。</p>

<p>最好是首先 <b>备份所有数据</b>。这相当的重要。我们无法知道会出现什么状况。
真的，我并不是在开玩笑。备份您的数据，准备一些空白CD，或者DVD，还需要一个移动
硬盘来备份您的数据，至少备份您的工作所需资料。 </p>

<p>之后对您的磁盘进行磁盘整理。在这之前，您的磁盘上的数据是零散的（Windows在对磁盘数据
储蓄管理上很差，Linux做得好很多）。磁盘整理后（这将花费您几小时或者几十分钟，这取决与您
磁盘上数据的多少和凌乱程度），所有的数据都会被聚集到了磁盘的开头（可以把它想象成很长的磁带
，数据被一直从开头到结尾的储蓄）。如果您的数据被很好的整理的，Linux便可以轻松的将一个分区划分
成两个，然后在新的分区上安装。</p>

<p>好了，准备工作都完成了，现在您可以开始选择安装哪一Linux发行版本了，Linux有很多的“风味”，
有不同的组织或公司制作，有不同的默认软件包，不同的外观界面，等等。他们都是Linux，只是不同
的“组装”。这里没有最好的选择（个人喜好不同），因此我不能帮助您选择了（很多人觉得自己的选择
的就是最好的），然而，这里我可以推荐4个最流行的发行版本，排名由<a 
href="http://www.distrowatch.com">distrowatch.com</a> 给出：</p>

<? make_distros_table() ?>

<p>当您选择好后，下载它的CD镜像，把它烧录在空白CD（或者DVD）上，重启计算机，
在BIOS设置里将CD-ROM设为第一启动，放入烧录好的CD，重启电脑。您的计算机将会使用
CD来启动，如果没有，请仔细检查BIOS设置。</p>

<p>这之后，您只需要按屏幕上的提示操作：安装非常的简单明了，不需要多少时间就可以完成。</p>

<p><b>祝愿您的Linux之旅愉快！</b></p>

