<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Βοηθήστε άλλες χώρες, και τη δική σας</h2>

<center>(Ευχαριστώ τον Gabriel E. Patiño -- gepatino {at}gmail {dot} com -- 
για την ιδέα και την πρώτη έκδοση του κειμένου) </center>

<p>Η Microsoft είναι μια αμερικάνικη εταιρεία, και η επιτυχία της είναι πολύ
καλή για την Αμερικανική οικονομία.</p>

<p>Αν όμως δεν ζείτε στις ΗΠΑ, όταν αγοράζετε κλειστό λογισμικό (πχ Windows), 
περίπου τα μισά χρήματα πηγαίνουν απευθείας στα κεντρικά γραφεία της εταιρείας
(πχ της Microsoft): αυτά τα χρήματα εγκαταλείπουν τη χώρα σας, ενώ τα άλλα μισά 
μένουν (ποσοστά πωλήσεων, κλπ: χωρίς τεχνικό όφελος). Η χώρα σας δεν παράγει
τίποτα, και δεν χρειάζεται καν ειδικευμένο προσωπικό για να πουλήσει κουτιά.
Κάτι τέτοιο οδηγεί σε επαγγελματίες πληροφορικής χωρίς υψηλό επίπεδο γνώσεων,
που απλά εγκαθιστούν και ρυθμίζουν κλειστό λογισμικό χωρίς την δυνατότητα
αλλαγής/μάθησης/βελτίωσης.</p>

<p>Με το δωρεάν λογισμικό (πχ το Linux), η οικονομία (και οι γνώσεις των
επαγγελματιών πληροφορικής) της χώρας σας βελτιώνονται, χάρη στην ύπαρξη
πολλών μικρομεσαίων επιχειρήσεων που θα προσφέρουν προσαρμοσμένες λύσεις,
υποστήριξη, συμβουλευτική, κλπ.</p>

<p>Οι άνθρωποι που έχουν τις γνώσεις και που διατηρούν τα χρήματα στην χώρα
σας θα επωφεληθούν από αυτό, αντί για εκείνους/ες που απλά πωλούν κουτιά με 
προκαθορισμένες ατάκες, στέλνοντας τα χρήματά σας εκτός της χώρας και αφήνοντας
επαγγελματίες πληροφορικής χωρίς πραγματικές τεχνικές γνώσεις.</p>

<img src="Images/earth.png" />

</div>
</body>
</html>
