<?php require("../../../entete.php"); ?> <?php require("../../../base.php"); ?> <?php require("../../../fonctions.php"); ?>

<div id="corps" class="rtl" dir='rtl'>
<h2>יום אחד עם לינוקס (סיור מודרך ומצולם)</h2>

<p>
כעת אתם בטח משוכנעים למחצה מכל הויכוחים, חושבים שלינוקס זה משהו מטרף להתנסות בו, אבל חוששים לעשות את הקפיצה הגדולה. כיצד תמצאו את הכלים והיישומים שאתם משתמשים בהם ביום יום ויחסרו לכם לאחר המעבר? האם כדאי לכם לבזבז את כל האנרגיה בגיבוי הנתונים, התקנת מערכת חדשה, רק כדי לגלות שאי אפשר להשתמש בה כי חסרה לכם תוכנה מתאימה?</p>

<p> אני מאמין שהתנסות עם live-cd (תקליטור חי) יעזור לכם לבחון האם לינוקס מתאימה או עדיין לא. אבל לפני זה, חשבתי להציג לכם מספר תמונות מסך של יום אופיני בשמוש בלינוקס, עם תכנות שונות, רק כדי להראות לכם איך זה נראה, להזמין אתכם לבקר בבית החדש למספר שעות לפני שתחליטו לבנות אותו. אחרי הכל, אם תבלו די זמן ליד המחשב כל יום, יתכן שתדעו להחליט נכון! </p>

<p>  זה סיור של צילומי מסך שמדגימים שמוש בלינוקס אובונטו. כמובן שכל הצבעים, הרקעים, הנושאים וכו', מאד קלים להתאמה! מה שתראו הוא רק ברירת המחדל של המערכת.</p>
<p> כשתכנסו לשולחן העבודה בפעם הראשונה, תראו משהו כזה:</p>

<img style="width:100%" src="Images/desktop.png" />

<p>מאד ברור, מאד פשוט, בלי שום ערבוביה על השולחן (עד שתשימו את שלכם שם!). היכן ההתחלה? תפריט היישומים הוא מקום טוב להתחיל אם אתם רוצים להתחיל לעבוד, שם התכנות שלכם מסודרות להדהים בקטגוריות (וכפי שהזכרנו קודם, כל מה שסביר שתזדקקו לו מגיע מותקן).</p>

<img style="width:100%" src="Images/applications.png" />

<p>אם תזדקקו למשהו שעדיין לא הותקן, תפעילו את "Ubuntu Software Center" או "מנהל החבילות" (או כל כלי מועדף אחר) מתפריט היישומים.  </p>
<p> אם תרצו לעיין בקבצים זמינים, תפריט המיקום נותן לכם הרבה קיצורי דרך שימושיים (כולם ניתנים לשנוי).</p>

<img style="width:100%" src="Images/places.png" />

<p>באילו יישומים אתם משתמשים בדרך כלל? אם אתם כמו הרוב, תתקשו לעבוד ללא דפדפן רשת טוב. שועל האש (FireFox) מותקן מראש:</p>

<img style="width:100%" src="Images/firefox.png" />
<p>אבל תוכלו בקלות להשתמש גם בדפדפנים אחרים, כדוגמת כרום:</p>

<img style="width:100%" src="Images/chrome.png" />
<p>גרסות הלינוקס של הדפדפנים הללו די דומות לאלו שאתם מכירים מ windows ,כך שתרגישו די "בבית" איתן.</p>

<p>הרבה אנשים מעדיפים לבדוק את הדואל שלהם בצורה מקוונת, עם ישום וובי כדוגמת Gmail, יאהו או הוטמייל - במקרה זה תסתפקו בדפדפן. אבל הרבה אנשים אוהבים לגשת למייל שלהם עם יישום ה למדי ..מקומי. אבולושן היא ברירת המחדל פה, והיא תראה לכם מוכר:</p>

<img style="width:100%" src="Images/thunderbird.png" />

<p> אבל דעו לכם שניתן לבחור בישומים אחרים, כדוגמת Thunderbird (צפור הרעם), שזהים לגרסות שרצות ב windows.</p>

<p>עם חבילת הישומים המשרדיים ככל הנראה תבלו זמן רב למדי. בחירה טובה היא היישומים המקוונים של גוגל שעושים עבודה טובה כאשר מדובר בשיתוף והפיכת המסמכים שלכם לזמינים מכל מחשב, אבל אם תעדיפו להריץ תכנה מקומית על המחשב שלכם, החבילה של openOffice.org תספק  כלים שיראו לכם מוכרים, כדוגמת מעבד תמלילים: </p>
<img style="width:100%" src="Images/oowriter.png" />

<p>לעריכת גליון אלקטרוני:</p>

<img style="width:100%" src="Images/oospreadsheet.png" />
<p>או מצגת:</p>

<img style="width:100%" src="Images/oopresentation.png" />

<p>כל התכנות הללו תראינה מאוד דומות לאלו שאתם משתמשים בהן. מציג PDF המשמש כברירת מחדל די חביב, פשוט וחזק:</p>

<img style="width:100%" src="Images/evince.png" />

<p>אם תרצו צ'אטים, תבלו זמן מה עם אפיפאני (אבל גם תכנות אחרות זמינות)</p>

<img style="width:100%" src="Images/empathy.png" />
<p>זכרו, אלו רק דוגמאות לכלים נפוצים, אבל הרבה אחרים זמינים לכל סוגי המשימות, והרגישו חופשיים להתקין כלים אחרים ולנסות אותם מפני שקל למצוא, להתקין ולהסיר אותם ממקום מרכזי אחד בלי לחפש באינטרנט ולמצוא הורדות, התקנות וקראקים. </p>
<p>כשרוצים לראות סרטים ומדיה, התכנה הזמינה מציגה וקוראת כמעט כל פורמט וידיאו שתתנו לה:</p>

<img style="width:100%" src="Images/movieplayer.png" />
<p>אבל גם הנגן VLC זמין וזהה לעצמו מגרסת windows.</p>

<p>למוזיקה, רית'מבוקס Rhythmbox מנגן כמעט הכל:</p>

<img style="width:100%" src="Images/rhythmbox.png" />
<p>וכמובן שיש גם נגנים אחרים כדוגמת אמרוק, בנשי ועוד.</p>

<p>כלי מאד שימושי לניהול תמונות (ארגון, מיון, תיוג, עריכה וכו') הוא Shotwell:</p>

<img style="width:100%" src="Images/shotwell.png" />

<p>אם תרצו גם ליצור תכנים, תהנו מיישומים כדוגמת GIMP לעריכת תמונות, תכנה חזקה במידה מדהימה (קיימת גם גרסה שלה לחלונות שתוכלו להתנסות בה).</p>

<img style="width:100%" src="Images/gimp.png" />
<p>לשרטוטים וקטוריים, Inkscape הוא כלי מאד קל לשמוש וחזק. (גם פה יש גרסה גם ל windows).</p>

<img style="width:100%" src="Images/inkscape.png" />
<p>הכלי המושלם לעריכת מוזיקה הוא Audacity (גם פה יש גרסה גם ל windows).</p>

<img style="width:100%" src="Images/audacity.png" />
<p>וגם Pitivi עושה עבודה טובה בעריכת וידיאו</p>

<img style="width:100%" src="Images/pitivi.png" />
<p>כמובן שאם ברשותך סורק תזדקק לתכנה לסריקת מסמכים:</p>

<img style="width:100%" src="Images/simplescan.png" />
<p>הרשו לנו לסיים את סיור המסכים הזה ביישום פשוט שיתכן שיתברר כשמושי למדי, כגון צורב מדיה (CD,DVD):</p>

<img style="width:100%" src="Images/brasero.png" />

<p>מנתח דיסקים מטורף, לראות אילו קבצים מנצלים את רוב נפח הדיסק על הכונן הקשיח שלכם:</p>

<img style="width:100%" src="Images/diskusage.png" />
<p>משחקון של "מגלה המוקשים" כשהבוס לא מסתכל ;-)</p>


<img style="width:100%" src="Images/deminer.png" />
<p>אם כל זה נראה כאילו שתבזבז זמן עם הכלים הללו (אשר, שוב, הם רק חלק קטן ממה שמגיע כברירת מחדל, וחלק זעיר מן התכנות הזמינות), אז נשמע שכדאי לך להמשיך לשלב הבא ולנסות לינוקס באמת!</p>

</div>
<?php require("../../../license_he.php");?>
</body>
</html>
