

---
lang: he
title: ספרים ותעשיית ההוצאה לאור</h2>

<p>התמיכה במודל הצבעים CMYK בתוכנות בלינוקס נחשבת עדיין ניסיונית. 
זו אמנם משתפרת אבל עדיין לוקה בחסר בכל מה שקשור לשימוש מקצועי.</p>

<p>למרות שרוב הספרים והמגזינים אודות תוכנה חופשית כבר עברו ללינוקס לפני זמן רב (והאם הם לא נראים נהדר?!),
אם הינכם עובדים בתעשיית ההוצאה לאור ומשתמשים בצבעי CMYK רבים, תמונות עדינות, אפקטים מיוחדים וכדומה, עדיף שתישארו עם חלונות לעת עתה. אבל עדיין תוכלו להתקין לינוקס, להשאיר את חלונות (ראו מדור ההתקנה), ולהשתמש בשניהם, על-פי הצורך.</p>

<p>שימו לב שתוכל להשתמש בעורך תמונות בשם <a href="http://www.kanzelsberger.com/pixel/">Pixel</a>,
שתומך בCMYK, אך אני עדיין סבור שמקומה של לינוקס אינה בחזית תעשיית ההוצאה לאור.</p>

