
<div id="corps">

<h2>Ти працюєш в друкарській справі</h2>

<p align="center">Переклад з німецької Юлії Гончарової</p>

<p>В операційній системі Linux підтримка CMYK все ще знаходиться на експериментальній стадії розробки. Хоча вона постійно вдосконалюється, проте все ще не може повністю задовольнити професіонала.</p>

<p>І хоча більшість книжок і журналів про вільне програмне забезпечення вже давно робляться на Linux (і хіба вони не виглядають чудово?!), тобі краще перший час залишатися в Windows, якщо ти працюєш в друкарській промисловості і використовуєш багато кольорів CMYK, хочеш отримувати якісні кольорові зображення, використовувати спеціальні ефекти друку і т.д. Крім того, ти можеш встановити Linux, залишивши Windows (дивися розділ по установці), і використовувати їх в залежності від твоїх потреб.</p>

</div>
</body>
</html>
