<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html style="direction: rtl;" lang="fa">
<head>
  <meta content="text/html;charset=UTF-8" http-equiv="Content-Type">
  <title></title>
</head>
  

<body>
<div style="font-family: Tahoma;" id="corps">

<h2>صنعت چاپ و نشر</h2>
نرم افزارهای لینوکس هنوز دارای تعداد کمی امکانات CMYK هستند.این در حال بهتر شدنه اما هنوز نیازهای حرفه ای رو جوابگو نیست.<br />
از اونجایی که اکثر کتابها و مجلات با موضوع لینوکس و نرم افزارهای رایگان
با لینوکس ساخته شده اند(و ظاهر عالی هم دارن)اگر شما در صنعت چاپ کار
میکنید و از رنگهای CMYK زیادی استفاده میکنید با عکسهای ظریف و جلوه های
چاپ سروکار دارید شما باید احتمالاً به ویندوز بچسبید.اما شما هنوز هم
میتونین لینوکس رو در کنار ویندوز نصب کنید(بخش نصب رو بخونید)و بر حسب
نیازتون از هر دوی اونها استفاده کنید.<br />
</div>

</body>
</html>
