

---
lang: bg
title: Книги и печатна индустрия</h2>

<p>Линукс софтуерът все още има много експериментална поддръжка на CMYK характеристиките. Тя става все по-добра, но все още не е на задоволително професионално ниво.</p>

<p>Въпреки, че повечето книги и списания за свободен софтуер преминаха към Линукс преди много време (и те не изглеждат ли чудесно?!), ако работите в печатната индустрия и използвате много CMYK цветове, преливащи картинки, специални печатни ефекти, може би засега трябва да си останете с Windows. Но и така може да си инсталирате Линукс, запазвайки Windows (вижте секцията Инсталиране) и според нуждите си да ги ползвате и двете.</p>

