

---
lang: th
title: ธุรกิจหนังสือและสิ่งพิมพ์</h2>

<p>ซอฟต์แวร์บนลินุกซ์ยังอยู่ในขั้นทดลองสำหรับการใช้สีในโหมด CMYK มันกำลังดีขึ้นเรื่อยๆ แต่ตอนนี้ยังไม่เป็นที่พึงพอใจแก่บรรดามืออาชิพทางด้านนี้ซักเท่าไร</p>

<p>อย่างไรก็ตามหนังสือ และนิตยสารหลายร้อยหลายพันฉบับที่เกี่ยวกับซอฟต์แวร์ฟรีก็ผ่องถ่ายมาใช้ลินุกซ์กันให้ครื้นเครง ใช้กันมานานแล้วด้วย (พิสูจน์กันได้เลยว่าพวกมันดูดีแค่ไหน?) หากคุณทำงานอยู่ในอุตสาหกรรมสื่อสิ่งพิมพ์ และใช้งานโหมด CMYK กันไม่ลืมหูลืมตา, มีรูปปะปนบ้าง, ผสมลูกเล่นแปลกๆ ฯลฯ คุณอาจจะต้องลอยคออยู่บนวินโดวส์ต่อไป แต่ทว่าคุณก็ยังลงลินุกซ์ได้อยู่เหมือนกัน ปล่อยวินโดวส์ไว้อย่างนั้นแหละ (ดูรายละเอียดเรื่องการติดตั้ง) และใช้งานมันทั้งคู่เพื่อตอบสนองความต้องการของคุณ</p>

</div>
