<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?>

<div id="corps">

<h2>クリックひとつで、ぜーんぶアップデート！</h2>

<p>Windowsにはずいぶんと古めかしいツールがあります。その名も「Windowsアップデート」。これでシステムは最新のアップデートを受けられるというわけ。</p>

<p>けど、マイクロソフト以外のソフトはどうなの？　アドビのソフトは？　ZIPの圧縮ソフトは？　CD焼き込みソフトは？　マイクロソフト純正じゃないブラウザやメールソフトは？　いちいち、それぞれアップデートしなきゃいけない。それぞれアップデートの方法が違うから（自動アップデートとか）時間がかかること、かかること。</p>

<p>Linuxには、「パッケージマネージャ」という管理センターがある。これはOSを隅から隅まで管理してくれるんだけど、それだけじゃない。パソコン上にあるソフト全部をまとめて管理してくれる。だから、<b>ぜーんぶ</b>アップデートするのだって、「アップデートをインストール」って書いてあるボタンをクリックするだけ。それだけ。ほんとに。</p>

<img src="Images/global_update.png" />

</div>
</body>
</html>
