<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps">

<h2>ទុក​ឲ្យ​ចោរ​ស៊ី​ផេះ​</h2>

<p>វីន​ដូ​មាន​បញ្ហា​សុវត្ថិភាព​<i>ច្រើន</i>  បញ្ហា​ទាំង​នេះ​អាចធ្វើ​ឲ្យ​មាន​ផល​លំបាក​យ៉ាង​ធ្ងន់ធ្ងរ​ ប្រសិន​បើ​អ្នក​ត្រូវ​បាន​ភ្ជាប់​ទៅ​អ៊ីនធឺណិត​ ។ 
បើ​ចោរ​ស្គាល់​អំពី​កំហុស​ពិសេស​ណា​មួយ​របស់​វីនដូ (ប្រភេទ​ខ្លះ​នៃ​ "ចន្លោះ​ប្រហោង​សុវត្ថិភាព​") នោះ​គេ​អាច​​តភ្ជាប់​ទៅ​ក្នុង​កុំព្យូទ័រ​របស់​អ្នក ហើយ​​គ្រប់គ្រង​កុំព្យូទ័រ​របស់​​​អ្នកស្ទើរ​គ្រប់​ពេល ។</p>

<p>លីនុច​មិ​ន​សូវ​ល្អ​ឥត​ខ្ចោះ​ប៉ុន្មាន​ទេ​ ប៉ុន្តែ​</p>

</div>
</body>
</html>
