<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" dir="rtl">

<h2>.بڕۆ بۆ نەوەی نوێی ڕوومێزەکان</h2>

<p>تۆ لەوانەیە زۆر سەرسام بووبێتی بە وێنەی سێ لایی یان  ڕوونی سیستمەکەی لە ڕوومێزدا کە ئەمەش یەکەم جار ویندۆزی ڤیستا دا بەدیکرا ، وە بڕیارت دا کە ئەم نوێکارییە تاکە لە شێوەی خۆیدا ، بەڵام ئەمە پارەیەکی باشت لێ ناسێنێت؟ بۆیە لە لینکوس :زۆر لەوە باشتر پێشکەش تر دەکرێت کە لەسەر ئەوەوە پێویستی پشتگیریکردنی ڕەقەکاڵای کەمتر پێویستە.</p>

<? all_video_ids_from_file ();?>

</div>
</body>
</html>
