<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Παρακολουθήστε τις καιρικές προβλέψεις.</h2>

<p>Βαρεθήκατε να έχετε ένα θερμόμετρο έξω από το παράθυρο και να το 
κοιτάτε πριν βγείτε έξω; Απλά ρίξτε μια ματιά στην οθόνη του Linux σας
και παρακολουθήστε τις καιρικές προβλέψεις:</p>

<img src="Images/weather.png" />

<p>Φυσικά, το Linux δεν σας αναγκάζει να κάνετε οτιδήποτε, οπότε μπορείτε
να το τοποθετήσετε όπου θέλετε στην οθόνη σας, ή και να το αφαιρέσετε 
τελείως (τελικά, δεν είναι πιο ωραίο να κοιτάτε έξω από το παράθυρο;). 
Μπορείτε να επιλέξετε τον τόπο που μένετε (ή οπουδήποτε αλλού) από μια
πλήρη λίστα τοποθεσιών (οκ, έκλεψα, επέλεξα την Χονολουλού για την παρακάτω
οθόνη, έχει 2°C αυτή τη στιγμή στο Παρίσι!)</p>

</div>
</body>
</html>
