<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" class="rtl" dir="rtl">

<h2>קפצו אל הדור הבא של שולחנות העבודה.</h2>

<p>גם אתם התרשמתם מיכולות השקיפות והתלת מימד שהוצגו לראשונה עם חלונות ויסטה והחלטתם שהיכולות המיוחדות הללו שוות כמה מאות שקלים? אתם אפילו קניתם מחשב חדש כדי שתוכלו לספק את הדרישות (המאוד גבוהות) של ויסטה? עבדו עליכם: לינוקס יכולה לעשות הרבה יותר ובחינם, ועם דרישות חומרה הרבה פחות מחמירות.</p>

<? all_video_ids_from_file ();?>

</div>
<?php require("../../license_he.php");?>
</body>
</html>
