

---
lang: ua
title: Ти запеклий гравець</h2>

<p align="center">Переклад з німецької Грицюка Володимира</p>

<p>Більша частина комп’ютерних ігор сумісна тільки з Windows, і ні з чим іншим. Деякі з них мають Mac- чи Linux-версії, але більшість з них, особливо нові, працюють тільки на Windows.</p>

<p>Тому якщо ти багато часу проводиш граючи в нові ігри, ти повинен залишатися на Windows. Але все одно ти можеш встановити Linux паралельно з Windows (див. розділ установки) і використовувати кожен з них за власними потребами.</p>

</div>
