

---
lang: bn
title: গেম</h2>

<p>বেশিরভাগ গেম বানানো হয় Windows এর জন্য, অন্য কোন প্লাটফর্মের জন্য নয়। কিছু গেমের Mac ভার্সন আছে, কিছুর আছে লিনাক্স ভার্সন (Quake 4, 
Neverwinter Nights, ইত্যাদি)। কিন্তু গেম ইন্ডাস্ট্রির সিংহভাগ পুরোপুরি Windows নির্ভর।</p>

<p>তা, আপনি যদি কড়া গেমার হন, নতুন গেম বের হবার সাথে সাথেই জয়স্টিক নিয়ে বসে যান পিসির সামনে, তাহলে আপনার জন্য Windows এর বিকল্প নেই। আপনি অবশ্য চাইলে গেম ছাড়া অন্যান্য কাজের জন্য Windows এর পাশাপাশি লিনাক্স ইন্সটল করে রাখতে পারেন (<a href="/switch/install/index_bn.php">"ইন্সটল" সেকশন দেখুন</a>)। </p>

<p>খুব সম্প্রতি বের হয়েছে, আপনি যদি এরকম গেম ছাড়া অন্য গেমে উৎসাহী হন, সেক্ষেত্রে লিনাক্সে উপায় আছে। Wine অথবা Cedega এর মত কিছু সফটওয়্যার আছে, যেগুলো দিয়ে একটু পুরনো Windows গেম (আসলে শুধু গেম না, বিভিন্ন Windows সফটওয়্যারও) মোটামুটি নির্বিঘ্নে চালানো যায়।</p>

