
<div id="corps">

<h2>Παιχνίδια</h2>

<p>Τα περισσότερα παιχνίδια είναι συμβατά με τα Windows, και τίποτε άλλο. Κάποια από 
αυτά έχουν εκδόσεις για το Mac, και κάποια από αυτά έχουν εκδόσεις για Linux (Quake 4, 
Neverwinter Nights, etc.), αλλά τα περισσότερα "τρέχουν" μόνο στα Windows.</p>

<p>Συνεπώς αν περνάτε αρκετές ώρες παίζοντας τα τελευταία παιχνίδια, καλό θα ήταν να μείνετε 
στα Windows. Μπορείτε όμως να εγκαταστήσετε το Linux, να κρατήσετε τα Windows (δείτε το κεφάλαιο 
εγκατάστασης), και χρησιμοποιήστε και τα δύο, ανάλογα με τις ανάγκες σας.</p>

</div>
</body>
</html>
