

---
title: משחקים</h2>

<p> רובם של המשחקים תואמים למערכת חלונות ולא למערכות הפעלה אחרות.
יש לחלקם גירסה למק ולכמה מהם יש גירסאות ללינוקס
(Quake 4, Neverwinter Nights, וכו') אבל רובם פשוט רצים על חלונות.</p>

<p>לכן, אם אתם מבלים זמן רב במשחקי מחשב כדאי לכם להיצמד לחלונות. אולם עדיין תוכלו
להתקין לינוקס, להשאיר את חלונות (ראו סעיף התקנה) ולהשתמש בשתיהן, לפי הצורך.</p>

<p>אם אתם מתעקשים לשחק במשחקים אבל לא חשובה לכם באיזו מידה הם חדשים, שימו לב שישנן תוכנות כגון Wine ו-
Cedega שיכולות לעזור להריץ משחקים לא כל-כך חדשים של חלונות תחת לינוקס ללא בעיות.</p>

</div>
</body>
</html>
