

---
title: Игры</h2>

<p>Большинство игр совместимы с Windows, и ничем больше. Некоторые также
имеют версии для макинтошей, другие - для Linux (Quake, Neverwinter Nights,
и другая классика), но всё же большинство игр пишется под Windows. Проблема
здесь не в том, что Windows столь хороша или другие платформы столь плохи.
Просто программисты вынуждены ориентироваться на массового пользователя
даже не взирая на актуальность проблемы... И всё же классика существует
на всех платформах.</p>

<p>Но если вы проводите много времени играя в только что вышедшие игры,
вы всё же останетесь в зависимости от Windows. В Linux существует
множество эмуляторов, два-три из них можно назвать сильнейшими - с
помощью них вы сможете запускать многие игры вплоть до DirectX 9 
включительно (на 2007-8 год). Также вы можете эмулировать полноценную
Windows внутри Linux или просто использовать двойную загрузку и 
использовать каждую ОС для своих целей.</p>

</div>
</body>
</html>
