<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Отримай чудовий музичний плейєр</h2>
<p align="center">Переклад з німецької Завгородньої Тетяни</p>
<p>Linux має багато музичних плеєрів  (AmaroK, Rhythmbox, Banshee, і т.д.), і деякі з них – <b>чудові</b>. Спробуй,наприклад, AmaroK (дивись скріншот): він має зручну систему управління, вивчає, які композиції ти найчастіше слухаєш, автоматично знаходить їхні назви, імена виконавців і тексти з інтернету і навіть відшукує ілюстрацію з обкладинки диска!</p>

<img src="Images/amarok.png" />

</div>
</body>
</html>
