<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" class="rtl" dir='rtl'>
<h2>אין בלגן בתפריט ההתחלה שלך</h2>

<p>אם יש לך חלונות והתקנת כמה תוכנות על המחשב, רוב הסכויים שתפריט ההתחלה שלך נראה כך:</p>


<img src="Images/windows_7_start_menu.png">

<p> נראה נורמאלי, נכון? ובכן, אתה בטח רגיל לזה כעת, אבל תגיד, זה לא מבולגן? וככל שתתקין יותר תכנות, המצב יהיה יותר גרוע.</p>

<p>  כל התכנות שניתנות להתקנה בלינוקס מגיעות עם מידע המסווג את התכנה, כך שהמשתמש (זה אתה!) לא צריך לעשות שום דבר כדי לשמור על הישומים שלו מסודרים למשעי בקטגוריות:  </p>


<img src="Images/categories_menu.png">

</div>
<?php require("../../license_he.php");?>
</body>
</html>
