
<div id="corps">

<h2>このソフト、こいつなしじゃ仕事にならないんだわ！</h2>

<p>つい最近まで、ほとんどのソフト会社はLinux用のソフト市場なんて小さすぎて、そんなソフトをリリースしても意味ない、って思っていた。というのはちょっとは変わってきたけど、それでもLinuxで動く有償のソフトはほとんどありません。</p>

<p>だとしても、有償の「必須のソフト」の代わりになるオープンソースのソフトがないわけじゃない（<a 
href="/items/warez/index_ja.php">この記事を参照</a>）。</p>

<p>こういった代替ソフトをまず、試してみましょ。Windows版もけっこうあったりするから、まずそれを使ってみるのもいいかも。スクリーンショットを見たり、機能一覧を見たり、それで大丈夫かどうかを事前チェック！</p>

<p>絶対にこれでなきゃ仕事になんない！っていうソフトがあるんなら、Windowsを使い続けるのがいいのかもしれません。ただし、WindowsとLinuxの両方のOSをインストールして、必要に応じて使い分ける方法もあるからね（「デュアルブート」っていいます）。</p>

<p>それに、Wineっていうプロジェクトがあって、ひょっとしたらWindowsのアプリケーションがLinuxで動くかもしれません。Wineプロジェクトのホームページ<a href="http://www.winehq.org">www.wineHQ.org</a>には、Wineで動くWindows用ソフトのリストもあるからね。もうひとつの方法は、Linux上のエミュレータでWindowsそのものを走らせること。ただし、重いソフトを動かすにはあんまり奨められないけれど。</p>

</div>
</body>
</html>
