

---
lang: th
title: ซอฟต์แวร์ปิด-Proprietary</h2>

<p>จน ณ ขณะนี้ผู้ผลิตซอฟต์แวร์ยังคงมองว่าลินุกซ์เป็นตลาดขนาดเล็กเกินกว่าที่จะลดตัวลงไปเกลือกกลั้วด้วย แม้ว่าจุดเปลี่ยนได้เริ่มต้นขึ้นแล้วแต่ซอฟต์แวร์ส่วนใหญ่ก็ยังคงเหย่อหยิ่งไม่ทำงานบนลินุกซ์อยู่ดี</p>

<p>ใครจะสนล่ะ ในเมื่อโอเพ่นซอร์สโปรแกรมหลายๆ ตัวได้ทยอยมาทำหน้าที่แทนโปรแกรมที่ "ขาดเสียไม่ได้" นั้นซะแล้ว (ลองดู<a href="/items/warez">ในนี้</a>)</p>

<p>ลองใช้งานโปรแกรมเหล่านี้ดู ปกติก็จะมีเวอร์ชั่นสำหรับวินโดวส์อยู่ด้วยซึ่งคุณสามารถลองใช้งานดูได้ทันที ดูที่หน้าตาและความสามารถทั้งหมด ดูว่ามันตอบสนองความต้องการของคุณได้อย่างสาสมหรือไม่</p>

<p>หากแม้นว่ามีบางโปรแกรมที่คุณขาดมันไม่ได้เสียแล้ว การเก็บวินโดวส์ของคุณไว้ย่อมเป็นทางเลือกอันประเสริฐ อย่างไรก็ตามคุณยังสามารถมีระบบปฏิบัติการได้เป็นสองบนเครื่องเดียวกัน (เราเรียกมันว่า "dual-booting") ซึ่งอาจจะทำให้อะไรมันดีขึ้นกว่าเดิม</p>

<p>จริงๆ แล้วมีบางโครงการที่เรียกกันว่า "Wine" ซึ่งจะช่วยให้คุณสามารถใช้โปรแกรมของวินโดวส์บนลินุกซ์ได้ คุณอาจจะลองเข้าไปดูที่โฮมเพจ เพื่อตรวจดูว่าโปรแกรมที่รองรับการทำงานแบบนี้มีตัวไหนบ้าง ไปที่ <a href="http://www.winehq.org">www.wineHQ.org</a> อีกทางเลือกหนึ่งคือการจำลองวินโดวส์ขี้นบนตัวลินุกซ์ อย่างไรก็ตามทางเลือกหลังนี้จะไม่เหมาะกับโปรแกรมที่กินประสิทธิภาพของเครื่องอย่างรุนแรง</p>

