

---
lang: bn
title: প্রোপ্রাইটরি (স্বত্ব-সংরক্ষিত) সফটওয়্যার</h2>



<p>এখনো অনেক সফটওয়্যার কোম্পানী মনে করে লিনাক্সের মার্কেট খুবই ছোট, এবং সেজন্য তাদের সফটওয়্যারের লিনাক্স সংস্করণ বের করে না। এখন অবশ্য অবস্থা কিছুটা পাল্টেছে, তারপরেও অধিকাংশ প্রোপ্রাইটরি সফটওয়্যার লিনাক্সে চলবে না।</p>

<p>তবে লিনাক্সে অনেক "প্রয়োজনীয়" প্রোপ্রাইটরি সফটওয়্যারের ওপেন সোর্স বিকল্প আছে (<a href="/items/warez/index_bn.php">এই সেকশন</a>টা দেখতে পারেন)।</p>



<p>এ প্রোগ্রামগুলো একবার চেষ্টা করেই দেখুন। এগুলোর অনেকগুলোর Windows ভার্সন আছে, যা চাইলে এখনই চালিয়ে দেখতে পারেন। স্ক্রিনশট আর ফিচারের তালিকায় চোখ বুলিয়ে দেখে নিন সেগুলো আপনার কাজে আসবে কিনা।</p>



<p>হতে পারে উইন্ডোজে এমন একটা সফটওয়্যার আছে যেটা ছাড়া আপনার কোনভাবেই কাজ চলছে না। সেক্ষেত্রে Windows থেকে সম্পূর্ণভাবে বেরিয়ে আসার সুযোগ থাকছে না। যাহোক, আপনি এক্ষেত্রে অন্যান্য কাজের জন্য Windows এর পাশাপাশি লিনাক্সও ইন্সটল করে রাখতে পারেন (এ ব্যবস্থা সাধারণত "Dual Boot" নামে পরিচিত)।</p>



<p>"Wine" নামে একটা প্রজেক্ট আছে, যার সাহায্যে বেশ কিছু Windows সফটওয়্যার লিনাক্সে চালানো যায়। তাদের <a href="http://www.winehq.org">হোমপেজে</a> গিয়ে কম্প্যাটিবল সফটওয়্যারগুলোর একটা লিস্ট দেখতে পারেন। আরেকটা উপায় হল লিনাক্সের ভেতর এমুলেটর (Virtual Machine) এর মাধ্যমে Windows পরিবেশ তৈরী করে Windows এর সফটওয়্যার চালানো। তবে খুব বেশী পারফর্মেন্স চায় এরকম প্রোগ্রাম (যেমন হাই-এন্ড গেম, 3D মডেলিং) এর জন্য এই ব্যবস্থা খুব একটা উপযোগী নয়।</p>



</div>
</body>
