<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Проприетарный, закрытый и платный софт</h2>

<p>К сожалению, многие разработчики ПО незаслуженно считают рынок открытых 
программных продуктов маленьким и не утруждают себя созданием копий своего ПО
для открытых систем. Эта тенденция в настоящее время изменяется, но всё же
много проприетарного софта не работает (или некорректно работает) в Linux.</p>

<p>Не смотря на это, существует достаточное количество достойных свободных аналогов
проприетарного софта (смотри <a href="/items/warez">вот этот</a> раздел).</p>

<p>Испытайте эти программы; часто разработчики открытого ПО создают и windows-версии,
чтобы Windows-зависимые пользователи могли испытать их продукты. Просмотрите также
скриншоты и описания возможностей, чтобы убедиться, что конкретная программа выполяет
все необходимые вам функции.</p>

<p>Если существует фрагмент софта, без которого вы никак не можете обойтись - неплохим
выбором будет организовать двойную загрузку ОС на вашем компьютере (т.е. оставить Windows
и установить дополнительно Linux). Вы сможете выполнять особые задачи в Windows, для остального
использовать более быстрый, стабильный, удобный, красивый и всячески хороший Linux :)</p>

<p>Существую также эмуляторы (напр. т. н. "wine"), с помощью которого, в некоторых
случаях, вы сможете обеспечить работу необходимого вам Win-софта в Linux. Можете посетить
домашнюю страничку проекта wine, которая включает список поддерживаемого (эмулируемого) 
софта, <a href="http://www.winehq.org">www.wineHQ.org</a>. Наконец, вы можете эмулировать
Windows целиком (как и Linux в Windows), хотя это и не всегда подходит для ресурсоемких задач.</p>

</div>
</body>
</html>
