

<h2>私有软件</h2>

<p>直到现在，很多软件发行商考虑到Linux市场太小，不值得在其平台上发布最新版软件。尽管这一切正在改变，但是还是有很多私有软件并不能在Linux上运行。</p>

<p>必须提到的是，有很多开源软件都可以代替现有的“必备”私人软件。（看<a href="/items/warez">这一章</a>）。</p>

<p>拜托请尝试一下这些软件；他们时常都会发布Windows版本，您现在就可以使用他们。看一看他们的截屏，是否符合您的要求。</p>

<p>如果有一些软件您实在无法离开他们工作，不要删除Windows是一个好的选择。不过，您可以有两个操作系统同时安装着（被时常称为“双重启动”），您可以这样做来满足您的需求</p>

<p>有一个著名的项目叫做“Wine”，一个能够让Windows程序在Linux上运行。您可以访问他们的首页，那里提供了可以兼容的软件列表：<a href="http://www.winehq.org">www.wineHQ.org</a>。另一个选择是努力让Linux赶上Windows，尽管对于运行超级专业程序并不适合。.</p>

</div>
</body>
</html>
