<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>如果不能使用某些非自由軟體，簡直會要了你的命</h2>

<p>到目前為止，許多軟體發佈者都認為 Linux 的軟體市場實在太小了，所以不會費心去推出 Linux 的版本。雖然這樣的情況正在改變，但是大部分的非自由軟體都沒有 Linux 的版本。</p>

<p>儘管如此，還是有一些開放原始碼的軟體可以取代這些「不可或缺的」非自由軟體（參見「如果你可以自由地取得軟體，哪還需要非法複製軟體呢？」）。</p>

<p>試試看這些軟體吧，它們通常都有 Windows 的版本，你現在就可以試試看。不妨看看它們的程式截圖和特色列表，並且評估它們是否能滿足你的需求。</p>

<p>如果你沒有軟體中的某個功能就不能工作，那麼也許繼續使用 Windows 是一個不錯的選擇。但是你也可以透過安裝兩套作業系統（通常稱為「多重開機」）來滿足你的需求。
</p>

<p>除此之外，有一個叫做「Wine」的專案，讓 Linux 在某些情況下能夠執行 Windows 的應用程式。你可以參觀它的網站，裡面還包含了相容軟體的列表，網址是 <a href="http://www.winehq.org/">www.wineHQ.org</a>。另外一個選擇，就是在 Linux 上直接模擬 Windows，但是這並不適合執行一些對效能有所要求的程式。</p>

</div>
</body>
</html>
 