

<h2>Хардуер</h2>

<p>Повечето хардуер си работи идеално с Линукс. Въпреки това, много нов хардуер (на няколко месеца), понякога не е поддържан. Подобно на софтуерните, много от хардуерните производители все още считат за много малък Линукс пазара и не си правят труда да осигурят Линукс драйвери за хардуера си. Линукс разработчиците работят върху това и вършат страхотна работа, за да накарат всяко парче хардуер да си работи, но това отнема малко време.</p>

<p>Най-добрият и пряк път да видите дали хардуерът ви е добре поддържан, е да стартирате Линукс от Жив диск (Live CD, вижте секцията "Опитайте Линукс, без да засягате Windows.").</p>

</div>
</body>
</html>
