<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html style="direction: rtl;" lang="fa">
<head>
  <meta content="text/html;charset=UTF-8" http-equiv="Content-Type">
</head>
  

<body>
<div style="font-family: Tahoma;" id="corps">

---
lang: per
title: سخت افزار</h2>
اكثر قسمتهاي سخت افزاري با لينوكس خوب كار ميكنند.اما سخت افزارهاي خيلي
جديد(در حد چند ماهه)بعضي اوقات شناخته نمي&zwnj;شوند.مثل سازندگان نرم
افزار،خيلي از سازندگان سخت افزار هنوز بازار لينوكس رو ناچيز ميدونن و
خودشون رو براي ساخت درايور راه انداز براي لينوكس به زحمت
نمي&zwnj;اندازند.برنامه نويسان لينوكس روي اون كار ميكنن و كارهاي سنگيني
رو انجام ميدن تا بتونن همه اجزائ اون قطعه رو در لينوكس بكار بندازن اما
خوب اين مدتي زمان نياز داره.<br />
بهترين و سرراست ترين راه براي اينكه ببينيم كه آيا سخت افزار ما با
لينوكس سازگار است يا نه استفاده از ديسكهاي زنده(Live CD)ها است.قسمت
"امتحان لينوكس بدون دست زدن به ويندوز" رو مطالعه كنيد.
<p></p>


</div>

