<?php require("../../../entete.php"); ?> <?php require("../../../base.php"); ?> <?php require("../../../fonctions.php"); ?>

<div id="corps">

<h2>লিনাক্সের সাথে একদিন (একটি স্ক্রিনশট ভ্রমণ)</h2>

<p>লিনাক্সের পক্ষে এতগুলো পয়েন্ট দেখে এতক্ষণে আপনি হয়তো ভাবছেন, একবার চেষ্টা করে দেখতে ক্ষতি কি? কিন্তু সাথে ভয়ও আছে... প্রতিদিন যেসব কাজে আপনি অভ্যস্থ সব লিনাক্সে করা যাবে তো? এত ঝামেলা (ডেটা ব্যাকআপ, সিডি ইমেজ ডাউনলোড করে রাইট) করার পর যদি দেখা যায় একটা অতি দরকারি জিনিস লিনাক্সে নাই... তখন কি হবে? 
</p>

<p>এ প্রশ্নের জবাব পাওয়ার সবচেয়ে সঠিক আর সহজ পথটা হল <a href="\switch\try">"Live CD" চালিয়ে দেখা</a>। তারও আগে, নিত্যদিনের লিনাক্স ব্যবহারের কিছু স্ক্রিনশট দেখে নিলে মন্দ হয় না। ব্যাপারটা অনেকটা নতুন বাড়ি ভাড়া নেবার আগে বাড়ির কিছু ছবি দেখে নেয়ার মত। কম্পিউটারের সাথে আমরা প্রতিদিন একটা উল্লেখযোগ্য সময় ব্যায় করি, সেক্ষেত্রে সঠিক সিদ্ধান্তটা অবশ্যই গুরুত্বপূর্ণ।
</p>

<p>আমরা যে স্ক্রিনশট ভ্রমণটা নিতে যাচ্ছি সেটাতে লিনাক্সের "Ubuntu" ডিস্ট্রিবিউশন (ফ্লেভার) দেখানো হয়েছে। ওয়ালপেপার, বিভিন্ন ভিজুয়াল এলিমেন্টের রঙ, থিম এগুলো ইচ্ছেমত পরিবর্তন করে নেওয়া যায় (আসলে লিনাক্সের কাস্টমাইজেশনের ব্যাপ্তি উইন্ডোজ বা ম্যাক থেকে অনেকগুন বেশি)। যাইহোক, এখানে ডিফল্ট (মানে শুরুতে যেটা দেয়া থাকে) চেহারা দেখানো হয়েছে। </p>

<p>প্রথমবার লিনাক্স ডেস্কটপ অনেকটা এরকম দেখাবেঃ </p>

<img style="width:100%" src="Images/desktop.png" />

<p>পরিচ্ছন্ন এবং সিম্পল; ডেস্কটপে কোন ঝামেলা নেই (এমনকি নতুন সফটওয়্যার ইন্সটল করলেও ডেস্কটপে কোন শর্টকাট তৈরী হবে না, যতক্ষন না আপনি নিজে শর্টকাট তৈরী করছেন)। শুরু করবো কোথেকে? "Application" মেনু (উপরে ডান কোনায়) থেকে শুরু করা যেতে পারে। সব সফটওয়্যার সেখানে ক্যাটাগরি অনুযায়ী সাজানো আছে (আগেও উল্লেখ করা হয়েছে, লিনাক্সে অনেক দরকারী সফটওয়্যার শুরুতেই ইন্সটল করা থাকে। <a href="/items/all_in_one">বিস্তারিত দেখুন</a>)। </p>

<img style="width:100%" src="Images/applications.png" />

<p>যদি এমন কোন সফটওয়্যার দরকার হয় যেটা ইন্সটল করা নেই তাতেও সমস্যা নেই। "Application" মেনু থেকে "Ubuntu Software Center" (অথবা আপনি যে ফ্লেভারের (ডিস্ট্রিবিউশনের) লিনাক্স চালাচ্ছেন সেটাতে সমতুল্য সফটওয়্যার) চালু করুন।</p>

<p>যদি কম্পিউটারে থাকা ফাইল-ফোল্ডারে ঘুরোঘুরি করতে চান তাহলে "Places" মেনুতে যেতে পারেন। সেখানে প্রয়োজনীয় কিছু জায়গা (যেমন বিভিন্ন ড্রাইভ, হোম ফোল্ডার, মাই কম্পিউটার এগুলোর) শর্টকাট করা আছে (এগুলো চাইলেই পরিবর্তন করা যায়)। </p>

<img style="width:100%" src="Images/places.png" />

<p>কোন এ্যাপ্লিকেশন আপনি সবচেয়ে বেশি ব্যবহার করেন? অধিকাংশ মানুষের জন্য উত্তরটা হবে ওয়েব ব্রাউজার। সবচেয়ে বহূল ব্যবহৃত ব্রাউজার Mozilla Firefox লিনাক্সে শুরুতেই ইন্সটল করা থাকেঃ</p>

<img style="width:100%" src="Images/firefox.png" />

<p>অবশ্য চাইলে Google Chrome বা অন্য ব্রাউজারও ইন্সটল করে নেয়া যায়ঃ</p>

<img style="width:100%" src="Images/chrome.png" />

<p>এসব ব্রাউজার লিনাক্স আর উইন্ডোজে পুরোপুরি একইরকম। তাই আপনার পরিচিতই লাগবে সবকিছু।</p>

<p>অধিকাংশ মানুষ ই-মেইল চালাচালির কাজটা ব্রাউজারেই করে। কিন্তু অনেকে আছে যারা ই-মেইলের জন্য Outlook এর মত লোকাল সফটওয়্যার ব্যবহার করে। একাজের জন্য লিনাক্সে দেয়া আছে "Thunderbird", যেটার চেহারা একাজের জন্য পরিচিত অন্য সফটওয়্যারগুলোর মতইঃ</p>


<img style="width:100%" src="Images/thunderbird.png" />

<p>একাজের জন্য আরো অনেক সফটওয়্যার আছে। উদাহরণ হিসেবে Mozilla Thunderbird এর কথা বলা যায়, যেটা দেখতে একদম এটার উইন্ডোজ ভার্সনের মতই।</p>

<p>Microsoft Office এর Word, Excel, PowerPoint সফটওয়্যারগুলোতে আপনি হয়তো একটা উল্লেখযোগ্য সময় কাটান। এ ধরনের কাজের জন্য ইদানিং Google Docs এর মত অনলাইন ব্যবস্থাগুলো জনপ্রিয় হয়ে উঠছে। এগুলোর জন্য লিনাক্স/উইন্ডোজে কোন পার্থক্য নেই। আর আপনি যদি এক্ষেত্রে Microsoft Office এর টুলগুলোর মত লোকাল এ্যাপ্লিকেশন বেশি পছন্দ করেন তাহলেও সমস্যা নেই। OpenOffice.org নামে একটা সম্পূর্ণ অফিস স্যুট আছে যাতে এসব কাজের জন্য আলাদা আলাদা সফটওয়্যার আছে। নিচে এর ওয়ার্ড প্রসেসরের ছবি দেয়া হলঃ </p>

<img style="width:100%" src="Images/oowriter.png" />

<p>অথবা স্প্রেডশীট এডিটরঃ</p>

<img style="width:100%" src="Images/oospreadsheet.png" />

<p>PowerPoint এর মত প্রেজেন্টেশন এডিটরঃ</p>

<img style="width:100%" src="Images/oopresentation.png" />

<p>এগুলো সব দেখতে আপনার আগে ব্যবহার করা সফটওয়্যারগুলোর মতই। ডিফল্ট PDF রিডার (Evince) দেখতে খুবই সাধারন ও হালকাপাতলা হলেও যথেষ্ঠ শক্তিশালীঃ</p>

<img style="width:100%" src="Images/evince.png" />

<p>অবশ্য চাইলে Adobe Reader ও ইন্সটল করতে পারেন।</p>

<p>অনলাইনে চ্যাট করতে ভালবাসেন? তাহলে "Empathy Instant Messenger" এর সাথে কিছু সময় কাটাতে পারেন।</p>

<img style="width:100%" src="Images/empathy.png" />

<p>লক্ষ্য করুন, এখানে শুধু খুব বেশি ব্যবহার করা হয় এমন কিছু টুলের নাম দেওয়া হয়েছে। প্রতিটা কাজের জন্য আরো অনেক অনেক সফটওয়্যার আছে। আপনি চাইলে সফটওয়্যার সেন্টারে গিয়ে প্রতিটা কাজের জন্য ইচ্ছেমত সফটওয়্যার ইন্সটল করতে পারবেন (সফটওয়্যার সেন্টার/প্যাকেজ ম্যানেজার হল সফটওয়্যার ইন্সটল/আনইন্সটল করার একটা কেন্দ্রীয় স্থান; <a href="/items/search_software">বিস্তারিত দেখুন</a> ) ।</p>

<p>মিডিয়া চালানোর জন্য ডিফল্ট মুভি প্লেয়ার বেশ ভালো কাজ করে। অল্প কিছু কোডেক ইন্সটল করে নিলে মোটামুটি সবধরনের ভিডিও চালানো সম্ভব।</p>

<img style="width:100%" src="Images/movieplayer.png" />

<p>চাইলে VLC media player ইন্সটল করে নিতে পারেন। দেখতে এটা ঠিক উইন্ডোজ ভার্সনের মতই।</p>

<p>মিউজিকের জন্য লোকাল মিডিয়া প্লেব্যাক থেকে শুরু করে মিডিয়া লাইব্রেরী ম্যানেজমেন্ট, বিভিন্ন ওয়েব স্টোর, ইন্টারনেট রেডিও শোনাসহ সবরকম ব্যবস্থা আছে Rhythmbox Music Player এঃ</p>

<img style="width:100%" src="Images/rhythmbox.png" />

<p>AmaroK, Banshee এর মত আরো কিছু চমৎকার মিউজিক প্লেয়ার আছে লিনাক্সে। </p>

<p>একটা মোটামুটি কাজের ছবি-ম্যানেজমেন্ট টুল (সাজানো, সর্ট, ট্যাগ, টুকটাক এডিট ইত্যাদি) হচ্ছে Shotwell:</p>

<img style="width:100%" src="Images/shotwell.png" />

<p>আপনি যদি কনটেন্ট তৈরীর কাজে আগ্রহী হন, সেক্ষেত্রে ছবি কাটাকুটি বা ভারী ধরনের এডিটিং এর জন্য আছে GIMP. এটা মোটামুটি ফটোশপের মতই খুব শক্তিশালী ইমেজ ম্যানিপুলেশন এ্যাপ্লিকেশন। এটার উইন্ডোজ ভার্সন আছে, চাইলে নামিয়ে দেখতে পারেন আপনার কেমন কাজে দেবে।</p>

<img style="width:100%" src="Images/gimp.png" />

<p>ভেক্টর-ভিত্তিক আঁকাআঁকির জন্য আছে Inkscape নামে খুবই সহজ কিন্তু শক্তিশালী সফটওয়্যার (এটারও উইন্ডোজ ভার্সন আছে)। </p>

<img style="width:100%" src="Images/inkscape.png" />

<p>Multi-track সাউন্ড রেকর্ডিং/এডিটিং এর জন্য Audacity চমৎকার একটি এ্যাপ্লিকেশন (এরও উইন্ডোজ ভার্সন আছে)।</p>

<img style="width:100%" src="Images/audacity.png" />

<p>Pitivi দিয়ে হোম ভিডিও এডিটিং এর কাজ হবে সহজেইঃ</p>

<img style="width:100%" src="Images/pitivi.png" />

<p>আপনার স্ক্যানার থাকলে Simple Scanner নামের সফটওয়্যারটি দিয়ে স্ক্যান করা ছবি পেতে পারেনঃ</p>

<img style="width:100%" src="Images/simplescan.png" />

<p>কিছু সিম্পল এ্যাপ্লিকেশন দিয়ে স্ক্রিনশট ভ্রমণ শেষ করা যাক... যেমন মিডিয়া (CD/DVD) বার্ণার/রাইটারঃ</p>

<img style="width:100%" src="Images/brasero.png" />

<p>কোন ফাইলগুলো ডিস্কের সবচেয়ে বেশি জায়গা নিচ্ছে সেটা দেখার জন্য আছে Disk Usage Analyzer:</p>

<img style="width:100%" src="Images/diskusage.png" />

<p>বস নেই? হয়ে যাক অল্প একটু Mines গেমঃ</p>

<img style="width:100%" src="Images/deminer.png" />

<p>এতসব (আবারো বলছি, লিনাক্সে যত সফটওয়্যার দেয়া থাকে বা ইন্সটল করার জন্য এ্যাভেইলেবল থাকে সেটার খুবই নগণ্য অংশ দেওয়া হয়েছে এই স্ক্রীনশটে ভ্রমণে) দেখে আপনার যদি মনে হয়, "নাহ, লিনাক্সটা হয়তো খারাপ না... চালিয়ে দেখা যাক" তাহলে আপনাকে অভিনন্দন। সময় হয়েছে সত্যিকার লিনাক্স চালিয়ে দেখার!</p>

</div>
</body>
</html>
