<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?>

<div id="corps">

<h2>ウィンドウ散らかりっぱなし。ワークスペース使えばいいのに</h2>

<p>私はWindowsは使わない人だけど、理解できないことがひとつある。Windowsを使う人って、凄い。だって、ワープロを開いて、ブラウザを開いて、メールを開いて、チャットを開いて、フォルダをいくつか開いて、その散らかったウィンドウの中で迷子にならないっていうんだからねっ。</p>

<p>ワークスペースだけは、何があっても手放せない機能。パソコン画面はひとつしかない、ですよねえ。Linuxだったら4つ。いえ、同時に4つの画面を見るわけじゃないんだけど、別にかまわないじゃない。ふつうでも右と左を同時に見ることなんかないんだから。第１の画面には、ワープロ開きましょ。2番めのには、チャットかな。3つ目の画面はブラウザ。こうすれば、例えばワープロで何か書いているときにネットでちょっと調べ物をしたくなったら、重なり合ったウィンドウの奥の方を探し回ってブラウザに行かなくても、画面を切り替えればいい。3番目の画面に、ほら、ブラウザがあるんだから。</p>

<p>Linuxの画面のスクリーンショットを見てごらん。画面の右下隅に注目。</p>

<img src="Images/workspaces.png" border="0"/>

<p>ここに「ワークスペース切替器」があるでしょ。4つの仮想スクリーンが、わかるかなあ。もっと増やすこともできるわけ（私は12枚使ってるし、もっとたくさん使ってる人もいる）。左端のが反転してるでしょ。それが使用中の画面。切り替えるには、行きたい画面をクリック。それぞれに開いてるウィンドウの小さなプレビューがあるからね。このスクリーンショットでは他の3つは空っぽだけど。あ、キーボードのショートカットもあるから。</p>

<img src="Images/workspaces_full.png" border="0"/>

</div>
</body>
</html>
