<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?>

<div id="corps">

<h2>Линукс защитава компютъра ви</h2>
Вируси, троянски коне, рекламен и шпионски софтуер... Windows им позволява доста лесно да влязат в компютъра ви. Средното време преди Windows компютър (свързан към Интернет и с инсталиран "Service Pack 2") да бъде заразен е <b>40 минути</b> (и понякога му трябват и само 30 секунди).</p>

<p>Вие може 1) да инсталирате защитна стена, 2) да инсталирате антивирусна програма, 3) да инсталиране програма за предпазване от рекламен софтуер, 4) да се отървете от Internet Explorer и Outlook (заменяйки ги с Firefox и Thunderbird) и 5) да се молите за това, пиратите да не са толкова умни, че да преодолеят тези препятствия, ако е открита пролука в сигурността, Microsoft за по-малко от месец да предостави осъвременяване (и това не се случва много често). Или може да инсталирате Линукс и да си спите спокойно от сега нататък.</p>

<p>Софтуер с отворен код (напр. Линукс), означава повече очи, който да гледат кода. Всеки програмист на планетата Земя може да свали кода, да му хвърли един поглед и да види дали има пролуки в сигурността. От друга страна, единствените хора, на които е позволено да гледат изходния код ("рецептата") на Windows, са хората работещи за Microsoft. Това са стотици хиляди (може би милиони) хора срещу няколко хиляди. Разликата е голяма.</p>

<p>Всъщност, няма особено значение <i>колко</i> пролуки има една система, в сравнение с друга. Ако има много пролуки, но никой (включително пиратите) не ги е открил, или са дребни (не излагат на риск важна част на системата), пиратите няма да способни да нанесат големи вреди. Наистина важното е <i>колко бързо пролука в сигурността може да бъде решена, след като е била открита</i>. Ако пролука в сигурността е открита в програма с отворен код, всеки в общността може да погледне и да помогне в решаването и. Решението (и осъвременяването) обикновено се появява след няколко дена, дори и след няколко часа. Microsoft няма такъв човешки ресурс и обикновено издава поправки по сигурността един месец, след като пролуката е била открита (и понякога публикувана): това е повече от достатъчно за пиратите да правят какво си поискат с компютъра ви.</p>


<img src="Images/security_thumb.png" />

</div>
</body>
</html>
