<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" class="rtl" dir="rtl">

<h2> השתמשו במסנג'ר, AIM, אייסיקיו וג'אבר בתוכנה אחת </h2>

<p> ייתכן שיש לכם חשבונות בכמה שירותי מסרים מיידיים כמו מסנג'ר, יאהו, אייסיקיו, ג'אבר, AIM וכו'. תחת Windows או OS X סביר להניח שתזדקקו לתוכנה נפרדת לכל אחד מן השירותים הללו: תוכנת לייב מסנג'ר לרשת מסנג'ר, תוכנת אייסיקיו לרשת אייסיקיו וכו'. </p>

<p> באמצעות פידג'ין, תוכנת המסרים המיידיים של לינוקס (קיימת גם גירסה לווינדוס וגירסה ל - OS X תחת השם "אדיום") תוכלו להתחבר לכל השירותים האלו בבת אחת ובאמצעות תוכנה אחת ולראות את כל החברים שלכם בכל הרשתות בו זמנית. </p>

<img src="Images/gaim_im_services.png" />

</div>
<?php require("../../license_he.php");?>
</body>
</html>
