<?php require("entete.php"); ?> <?php require("base.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps" class="rtl" dir="rtl">

<h2>רשימת שאלות נפוצות (FAQ) קצרה עבור חובבי לינוקס</h2>

<p>אוקיי, הייתי יכול להתחיל בהדגשה, שכמו
שוודאי שמתם לב, אתר זה בעצם לא נועד עבורכם :-)
אתר זה נועד למשתמשי חלונות (או Mac) שמנסים לפענח את חידת "לינוקס", איך היא נראית, ולראות אם יש משהו בה, שטובה עבורם.
קרוב לוודאי שלא תמצאו מידע חדש כאן, והייתם יכולים באותה המידה להמשיך לקרוא את סלאשדוט ! :-p </p>

<ul>

<li><p><b>ש: לינוקס היא בקושי מערכת הפעלה מלאה כמו חלונות, היא בסך הכל הליבה. למה לגרום
למשתמשים להאמין אחרת ?</b></p> <p>ת: סנטה לינוס, אנא סלח לי :-) זה פישוט מרצון.
אם תתחילו להסביר נקודה זו, העובדה שלינוקס זה שם הליבה, ושספקים שונים בוחרים לספק את לינוקס עם תוכנות לפי
בחירתם כדי ליצור "הפצת לינוקס", וכו', חצי מהקהל שלכם כבר עזב.
אתר זה לא נועד עבור אנשים שכבר משתמשים בלינוקס בתור מערכת ההפעלה הראשית שלהם (אלא אם הם רוצים לעזור לשפר את האתר). מאותן הסיבות, ולשם הפשטות, אינני מדבר על גירסאות ה-BSD השונות ועל העובדה שרבים מהשרתים <i>הגדולים</i> מריצים BSD ולא לינוקס.</p> 
</li>

<li><p><b>ש: למה הינך טוען שמערכת הפעלה מסוימת יותר טובה מאחרת?
זה תלוי במה שאנשים רוצים לעשות איתה.</b></p>
<p>ת: כמובן שזה תלוי, אני מסכים לחלוטין. אבל נהיה ברורים באשר למה שאני מנסה לומר כאן:
<ol><li>לתת למשתמשי חלונות או Mac לדעת שיש עוד משהו שם.</li>
<li>לתת כמה סיבות למה לינוקס היא מערכת הפעלה מעולה, ולמה רוב הזמן זו בחירה די טובה.</li></ol>
ברור, ששם האתר יותר פשוט מכך, אבל היי, האם הייתי אמור לקנות
<span dir="ltr">whylinuxmaybebetterinmanycases.net</span> ?</p>

<p>אינני מומחה לינוקס, ואינני גורו של אף כת,
ואינני רוצה להמיר נפשות: אני פשוט משתמש לינוקס מרוצה מאוד וגם מפתח,
ומנסה לגרום לאנשים נוספים לדעת על לינוקס.</p>

</li>

<a name="gnu"><li><p><b>ש: זה גנו/לינוקס, לא לינוקס, אימבציל!</b></a></p>

<p>ת: באתר עבור משתמשי לינוקס מתקדמים, יש חשיבות לפרט כזה,
אבל כאן אני רוצה לשמור על הפשטות. אנשים שמעו על "לינוקס", לא "גנו/לינוקס", וסוג זה של מריבה בין גיקים הינו
קרוב לוודאי אחת מהסיבות שמונעות מאנשים "רגילים" מלהבין מה כל זה אומר.
מאותה הסיבה, אני כותב "OpenOffice" במקום "OpenOffice.org" וכך הלאה.</p>

<p>ודרך אגב, "ש:" זה אינו שאלה, כי אין בו סימן שאלה.
אבל מה זה משנה, מכיוון שאני כותב גם שאלות וגם תשובות... אוה, אני באמת אימבציל.</p>

</li>

<li><p><b>ש: שמע, ברנש, האנגלית שלך מחורבנת.</b></p>
<p>ת: כן, אני יודע. ואני עובד על זה. נא להעביר את השבט.</p>
</li>

<li><p><b>ש: יש רושם שהינך מתרכז בגנום ובאובונטו.
האם יש בך מרירות כלשהי כלפי KDE והפצות אחרות ?</b></p> <p>ת: כמובן שלא.
אני אוהב ומשתמש ביישומי KDE רבים (אם כל המאמצים המושקעים בטרולי גנום לעומת KDE היו מושקעים בשילוב
יישומי KDE בגנום ולהפך, הייתי ממש מאושר). תמונות המסך שלי מראים בעיקר את אובונטו מכיוון שזו ההפצה
שאני משתמש ומפתח בה.
מיותר לציין, שהינך חופשי לשלוח לי תמונות מסך אחרות. ודאי שמת לב שיש לי אייטם על Amarok, אנא אל תהסס לשלוח לי הצעות נוספות ליישומי KDE (וגנום!) אחרים.</p> </li>

<li><p><b>ש: מה בכלל אתה יודע על לינוקס ?</b></p> 
<p>ת: קרוב לוודאי לא כמו שאני צריך! אני חבר בפרויקט אובונטו,
אני משתמש בלינוקס מאז ~1998, כתבתי כמה ספרי כיס (בצרפתית) על כמה תוכנות קוד פתוח (פיירפוקס, לינוקס, וכו'). אבל אני מנסה לשפר את המצב, ולא מזמן הזמנתי את הספר
 "הבנת ליבת לינוקס" (עד שתקרא את זה, ייתכן שסיימתי לקרוא את הספר, הבנתי כל מה שיש להבין על לינוקס וכעת אני רוצה ליצור את הגירסא שלי, שאין ספק שאקרא לה "מאנוקס" - אוקיי, ייתכן שלא).
</p> </li>

<a name="gaming"><li><p><b>ש: לדבריך, גיימרים אינם אמורים לעבור ללינוקס,
אבל אינך יודע על Wine, Cedega, Steam? הם עובדים לא רע עבור מספר הולך וגדל של משחקי חלונות.</b></p><p>ת: אני מסכים שפתרונות תוכנה שונים הפכו את המשימה של הרצת משחקי חלונות בלינוקס לקלה יותר ממה שהיתה פעם.
זה פתרון טוב לגיימרים מזדמנים. אבל שים לב שהשתמשתי בביטוי "גיימרים מושבעים", כאלה שקונים את המשחקים החדשים ביותר ודוחפים את המעבדים שלהם לעבודה בתדר שעון גבוה יותר לביצועים יותר טובים; אני בספק אם הם יהיו מוכנים להתפשר על יישומים כאלה.</p></li>

<a name="distros"><li><p><b>ש: בבקשה הוסף את הפצת לינוקס XYZ לעמוד שלך
על התקנת לינוקס.</b></p><p>ת: יש הרבה, הרבה הפצות בעולם, ואף תת קבוצה מוגבלת
לא יכולה לספק את כולם.
עבור אלה שרוצים לנסות את לינוקס, זה כבר מבלבל שיש הרבה "גירסאות/טעמים" של לינוקס.
בחרתי להזכיר 4 מהם שהיו ועדיין בין הפופולריים ביותר, ואני חושב שזו בחירה סבירה.</p></li>

<li><p><b>ש: האם אינך הברנש התמהוני <a 
href="http://www.manucornet.net/pcjacking">PCJacking</a> ?</b></p>
<p>ת: אוף, כן.</p>
</li>

<li><p><b>ש: האם אינך המפתח המגוחך של <a 
href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a> 
 ?</b></p>
<p> ת: כן, תפסת אותי :-) אבל גם <a 
href="http://jb.rouquier.free.fr/">ג'ין-בפטיסטה רוקו</a> עשה
חצי מהעבודה. אוקיי, יותר, המממ, השאלה הבאה בבקשה.</p>
</li>

<li><p><b>ש: האם לא הייתה אחד מהברנשים המופרעים של <a 
href="http://code.google.com/summerofcode.html">גוגל קיץ של קוד</a>,
אחד מה-400 שנבחרו מבין 9000 האקרים ?</b></p> <p>ת: כן.
אבל פשוט הייתי בר מזל: שלחתי 8000 מאותן הצעות לפרויקטים, ואחת מהן התקבלה.  אוקיי, הייתי בר-מזל פעמיים (2005, 2006).
בשנה הבאה אפרסם את מחולל הפרויקטים האוטומטי שלי כקוד פתוח. </p> </li>

<li><p><b><a name="help">ש:: היי, אינני יכול לגרום ל-XYZ לעבוד על לינוקס.
האם תוכל לעזור לי?</a></b></p>

<p>ת: מצטער, אבל אין להתייחס לכתובת הדוא"ל שלי כאל שם נרדף לתמיכה בלתי מוגבלת בלינוקס :-)
כמו אנשים רבים, יש לי הרבה דברים לעשות, ובעוד שאני שמח לעזור כשאני יכול ויש לי זמן לכך, אני בטוח
שיש הרבה אנשים בפורומים או בערוצי IRC שישמחו יותר
<a href="http://www.whylinuxisbetter.net/items/help/index.php">לענות לשאלותיך</a>!
וכמובן חיפוש ב-<a href="http://www.google.com">גוגל</a> 
הינו תמיד מקום טוב להתחיל בו.</p></li>

<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>
<?php require("./license_he.php");?>
</body>
</html>
