<?php require("entete.php"); ?> <?php require("base_ja.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>LinuxギークのためのちょっとしたFAQ</h2>

<p>はいはい、おわかりとは思いますが、このウェブサイトはGeek、オタク、専門家であるあなたのためのもんじゃ、ありません。「Linuxって何さ？」と思っているWindows（それにMac）ユーザー向けのものです。Linuxってどんなもの？　Linux使って何かいいことあるの？　そんな疑問に答えようとするものです。だから、あなたにとって目新しい情報はなんっにもありまっせん。Slashdot!でも読んでた方が、たぶんオトクでしょう。</p>

<ul>

<li><p><b>Q: LinuxはOSじゃない、カーネルに過ぎないんだっ。ユーザーを誤解させてどうすんだよっ！</b></p>
<p>A: 聖ライナス様、どうかお許しを。あの、わざと単純化しておりますです。そこから話を始めるとですねえ、つまり、そもそもLinuxとはカーネルの名前であり、ベンダーごとにそれぞれの選択からなるソフトウェアを組み合わせて「Linuxディストリビューション」ができて云々かんぬんなんてところから話を始めているとですねえ、お客さん、ぜんぶ逃げちゃうんですよ。このサイトは、既にLinuxをメインで使っている人のためのものじゃありませんのでねえ（あ、もちろんそういう人がサイトの改良を手伝ってくれるのは歓迎ですよ。それとか、「言葉がおかしい」とか。なんせフランス人が英語で作ったサイトですから）。</p> </li>

<li><p><b>Q: なんであっちのOSがこっちのOSよりもいいとか悪いとか言うんだよ。そんなもん、何をしたいか、何に使うかで変わってくるだろうが。</b></p>
<p>A: もちろんそうです、ええ、その通りですとも。ただ、ここで言いたいことをはっきりさせておきましょうよ。1）Windowsユーザー・Mac OSXユーザーに、それ以外にも選択肢があるんだよってことを知らせたい。2）なぜLinuxが優れたシステムであるのかいくつか理由をあげておきたい。そして、Linuxを選択することが正解な場合が多いのはなぜかを指摘しておきたい。以上2つです。だったらサイトのドメイン名（「なぜLinuxの方がいいのか」）がちょっとストレート過ぎはしないかって？　じゃあ、「なぜLinuxの方が多くの場合いかもしれないのか」<tt>whylinuxmaybebetterinmanycases.net</tt>みたいな長ったらしいドメイン名にすればよかったのかな？ </p>
<p>私はLinuxのエキスパートじゃないし、派閥のリーダーでもありません。エヴァンジェリストみたいに格好つけるつもりもないしね。ユーザーとして、開発者としてLinuxに満足していて、もっとたくさんの人にLinuxを知ってもらいたいと思っているだけなんです。</p>

</li>

<li><p><b>Q: GNU/Linuxでしょ！　Linuxじゃなくて。わかってないなぁ。</b></p>
<p>A: 上級Linuxユーザー向けのウェブサイトなら、こういった細かいところへの目配りは大事だと思いますよ。けど、なるべく込み入った話は抜きにしましょ。「Linux」のほうが「GNU/Linux」よりもずっとよく耳にするし、こういったGeekにしか通用しない論争こそが「ふつうの人」の理解を妨げることになるんですからね。私が「OpenOffice.org」じゃなくて「OpenOffice」って書くのも同じ理由。以下同じ。</p>

<p>もうひとつ、この「Q」は「質問」じゃない。だって疑問文になっていないからね。わかってないなぁ。ま、いいか。QもAも私が書いてるんだから……。おっと。</p>

</li>

<li><p><b>Q: あんたの英語、おかしいよ。</b></p>
<p>A: わかってますって。がんばってます。で、どこがおかしいか教えてくださいよ。</p>
</li>

<li><p><b>Q: GNOMEとUbuntuばっかりじゃない。KDEに恨みでもあるの？　他のディストリビューションは？</b></p>
<p>A: まさか、まさか。KDEのアプリにはお世話になっているし、愛用してますよ（GNOME対KDEの荒らしに使うエネルギーをKDEのアプリをGNOMEに統合することや、GNOMEのアプリをKDEに統合することに使ってもらえるなら、ほんとはそれがいちばんと思うんだけど）。スクリーンショットのほとんどがUbuntuなのは、単に私がUbuntuを使っているからだし、私がUbuntuの開発に参加しているからなんですよ。だからもちろん、もちろん、お気軽に他のスクリーンショットも送ってくださいね。AmaroKの記事を入れておいたのにお気づきかと思いますけど、他にもKDEのアプリ（GNOMEのアプリもね！）でこれを入れたらというのがあったら、どんどん提案してくださーい。</p> </li>

<li><p><b>Q: あんたにLinuxの何がわかってんの？</b></p> 
<p>A: いや、もっと勉強すべきなんでしょうね。私はUbuntuのメンバーで、Linuxは1998年から使っていて、オープンソースのソフト（FirefoxとかLinuxとか）についてのポケット・ブックを何冊か（フランス語で）書いています。勉強不足をなんとかしようと思って、「Linuxカーネル詳解」なんて本を発注したところです（あなたがこれを読む頃には、読み終わっているかな。そしたらLinuxに関して何でも知っているようになって、自分自身のバージョンを作ろうかなんて思っているだろうか。Manuxなんてのを作ったり……いやいや、やめとこ）。</p> </li>

<li><p><b>Q: えっと、あなたは<a 
href="http://www.manucornet.net/pcjacking">PCJacking</a>やってる、あのManuさんなの？</b></p>
<p>A: おっと、そうだよー。</p>
</li>

<li><p><b>Q: えっと、あなたって、<a 
href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a>やってる、あのManuさんなの？</b></p>
<p>A: おっと、バレたか。でも、<a 
href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a>が半分はやってくれたんだからね。オーケー、ほかには？　次の質問、どうぞ。</p>
</li>

<li><p><b>Q: えっと、あなたって、<a 
href="http://code.google.com/summerofcode.html">Google's Summer of 
code</a>で9000人から選ばれた400人の中に入っているあの有名ハッカーなの？</b></p>
<p>A: うん。でも、運がよかっただけなんだ。9000個の応募案件のうち8000個は私が応募したプロジェクトだからね。1個だけでも受かってよかったよ。来年は、私の自動プロジェクト生成装置をオープンソースにするから、お楽しみにー。</p> </li>


<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>

</body>
</html>
