<?php require("entete.php"); ?> <?php require("base.php"); ?> <?php require("fonctions.php"); ?>

<div id="corps">

<h2>﻿리눅스 괴짜들을 위한 약간의 FAQ</h2>

<p>자, 이것을 미리 말씀드려야겠습니다. 이 사이트는 아시다시피 당신같은 분들:)을 위한 곳이 아니라 "리눅스"가 무엇인지, 어떻게 생겼는지, 쓸만한 것이 있는지 알고 싶은 윈도우즈(혹은 맥) 사용자들을 위한 곳입니다. 이곳에서 당신이 새로 배울만한 것은 아마 없을 것이고, 그냥 slashdot 사이트에서 노십시오! :-p</p>

<ul>

<li><p><b>Q: 리눅스는 자체만으로 윈도우즈같은 완전 운영체제가 아니고 그저 커널을 뜻합니다. 왜 이용자들에게 다르게 가르쳐 주나요?</b></p> <p>A: 리눅스 신이시여 용서해 주십시오 :) 그것은 임의로 단순화된 표현입니다. 리눅스라는 표현은 커널의 이름일 뿐이고 각 배포처들이 그들이 원하는 응용 프로그램을 집어넣어서 "리눅스 배포본"을 만든다는 사실 등등을 처음부터  제대로 설명하기 시작한다면 벌써 절반은 듣다가 도망쳤을 것입니다. 이곳은 이미 리눅스를 주 운영체제로 사용하는 사람들을 위한 것이 아닙니다(이 사이트를 더 좋게 만들기 위해 도움을 주는 경우를 제외하고). 이러한 이유와 설명의 간편성을 위하여 <i>대형</i> 서버들은 리눅스 대신 BSD를 돌린다는 것과 다양한 BSD운영체제가 존재한다는 것은 언급하지 않았습니다.</p> 
</li>

<li><p><b>Q: 왜 특정 OS가 다른 것보다 좋다고 말씀하시나요? 좋다 나쁘다라는 판단은 사용하는 사람에 달리지 않았나요?</b></p>
<p>A: 물론, 당연히 그렇고 저도 동의합니다. 그러나 제가 이곳에서 말하고자 하는바에 대해 다시 한번 짚어봅시다: 1) 윈도우즈/맥OS X 사용자들에게 다른 운영체제가 존재한다는 것을 알린다. 2) 리눅스가 좋은 운영체제라는 것에 대한 약간의 설명을 제공하고, 왜 대부분의 경우 리눅스가 좋은 선택인지 설명한다. 틀림없이 이 웹사이트의 이름이 위 설명보다 화끈합니다만, 여러분, 제가 <tt>whylinuxmaybebetterinmycases.net</tt> 이라는 주소를 샀어야 하나요?</p>

<p>저는 리눅스 전문가도 아니고 어떤 운동가도 아니며 또한 믿음을 전파하려는 것도 아닙니다. 저는 그저 리눅스의 매우 행복한 이용자이며 개발자이고, 많은 사람들에게 리눅스에 대해 알리고 싶을 뿐입니다.</p>

</li>

<a name="gnu"><li><p><b>Q: 리눅스가 아니고 GNU/리눅스 잖소!!</b></a></p>
<p>A: 고급 리눅스 사용자들을 위한 웹사이트라면 그렇게 정확한 표현을 해주는 것이 중요하겠지만, 저는 매우 간단하게 설명하고 싶었습니다. 사람들은 "리눅스"에 대해 들어봤을 뿐 "GNU/리눅스"에 대해서는 들어보지 못했을 것입니다. 또한 이러한 의미없는 논쟁은 아마도 "보통의" 사람들이 리눅스가 무엇인지 이해하는 것을 방해하는 장벽 중 하나일 것입니다. 이러한 이유로 저는 "Openoffice.org"대신 "OpenOffice"를 사용하는 등의 단순화 방법을 이용했습니다.</p>

<p>그나저나 "Q:"이것은 질문이 아닙니다. 왜냐하면 물음표가 없기 때문이죠. 어쨌건, 제가 이 질문과 답을 다 만들었으니 흐..저도 참 멍청하죠.</p>

</li>

<li><p><b>Q: 이봐요, 영어가 너무 서툴러요.</b></p>
<p>A: 네, 저도 알고 있습니다. 그리고 노력하고 있으니 너그러이 봐주세요.</p>
</li>

<li><p><b>Q: GNOME와 우분투에 관심있으신 것 같아 보이는데요. KDE라던가 다른 배포판에 대한 악감정은 없으신가요?</b></p> <p>A: 당연히 없죠. 저는 KDE 응용 소프트웨어들을 너무나 좋아합니다(GNOME 대 KDE라는 논쟁에 소비되는 정력이 KDE의 애플리케이션들이 GNOME에서 작동하도록 변환하는 등의 노력에 쓰여진다면 저는 정말 기쁠 겁니다). 제 스크린샷들은 우분투 위주로 찍혀있는데요, 그것은 제가 사용하고 개발하는 배포본이 우분투이기 때문입니다. 아마 제가 AmaroK같은 것을 언급했을 때 눈치채셨겠지만, 제게 다른 KDE(GNOME도!) 애플리케이션에 대한 추천을 보내는 것을 주저하지 마세요.</p> </li>

<li><p><b>Q: 도대체 리눅스에 대해서는 얼마나 알고 있습니까?</b></p> 
<p>A: 아마도 제가 꼭 알아야하는 모든 것들을 다 알지는 못할 겁니다. 저는 우분투 팀의 일원이고, 리눅스는 1998년도부터 이용해 왔으며, 몇몇 공개 소스 소프트웨어(파이어폭스, 리눅스 등등)에 대해서 프랑스어로 몇 권의 포켓북을 썼습니다. 하지만 더 나아지려고 노력하고 있습니다. 지금 "리눅스 커널에 대한 이해"라는 책을 주문했습니다.(당신이 이 글을 읽고 있을 때쯤이면, 저는 그 책을 다 읽었을 것이고, 리눅스에 대해 조금더 이해하고 꼭 "Manux"라고 부를 저만의 리눅스를 만들려고 하고 있겠지요. 아마도요.ㅋ)</p> </li>

<a name="gaming"><li><p><b>Q: 게이머들에게는 리눅스로 전환하지 않는 것이 좋을 것이라 했는데, Wine이나 Cedega같은 프로그램에 대해 모르나요? 이것들은 리눅스에서 점점 더 많은 윈도우즈 게임을 이용가능하게 해주고 있는데요.</b></p><p>A: 예전에 비해서 지금은 다양한 소프트웨어적 해결책들이 리눅스 상에서 윈도우즈 게임을 돌리는 것을 가능하게 한다는 것에 대해 동의합니다. 이 해결책들이 일반 게이머에게는 유용합니다만, 제가 언급한 것은 최신게임을 즐기며 성능을 올리기 위해 CPU 오버클락을 하는 “하드코어 게이머”들의 경우입니다; 이런 경우에도 해결책이 있을지는 의심스럽습니다.</p></li>

<a name="distros"><li><p><b>Q: 리눅스 배포본 뭐뭐뭐에 대해서도 설치하는 법을 올려주세요.</b></p><p>A: 리눅스에는 아주아주 많은 배포본들이 있습니다. 그래서 어떤 제한된 설명으로 모두를 만족시키는 것은 불가능합니다. 리눅스를 시도해 보려는 사람들은 이미 리눅스에 여러 “버전/가지”가 있다는 것에 혼돈스러워합니다. 저는 가장 인기있는 4가지를 골랐으며, 이것은 합리적인 선택이라고 생각하고 있습니다.</p></li>

<li><p><b>Q: 당신 혹시 그 “<a href="http://www.manucornet.net/pcjacking">PCJacking</a>”하는 괴짜 아닌가요?</b></p>
<p>A: 엇, 맞아요.</p>
</li>

<li><p><b>Q: 당신 혹시 그 <a href="http://www.manucornet.net/Informatique/Gimp_Texturize.php">GIMP-Texturize</a>를 담당하는 괴짜 아닌가요?</b></p>
<p>A: 넵, 맞습니다. 그런데 <a href="http://jb.rouquier.free.fr/">Jean-Baptiste Rouquier</a> 란 분도 그 일의 반을(이런, 사실은 반 넘게) 하셨답니다. 흠흠, 다음 질문 주세요. </p>
</li>

<li><p><b>Q: 당신 혹시 9000명 중 400명의 해커를 뽑는 데에 들어간 <a href="http://code.google.com/summerofcode.html">Google’s Summer of code</a> 의 괴짜 아닌가요?</b></p> <p>A: 예, 하지만 단지 운이 좋았을 뿐이에요:  9000개의 프로젝트 계획에 대해 8000개를 보냈었는데, 하나가 승인되었을 뿐이거든요. 네, 두 번 운이 좋았죠(2005, 2006). 내년에는 저의 자동 프로젝트 생성기를 공개하려구요.</p> </li>


<li><p><b>Q: 안녕하세요! 리눅스에서 뭐뭐뭐가 잘 안되는데요. 도와주실수 있나요?</b></p> <p>A: 죄송합니다만, 제 이메일로 끝없는 리눅스 지원요청이 와서는 곤란합니다. 다른 분들처럼, 저도 해야 할 일이 많거든요. 물론, 제가 시간이 있을 때면 기꺼이 도와드리겠습니다만, 포럼이나 IRC채널에 계신 분들이 더욱 잘 도와주실 거라 믿습니다! 또한 구글 검색도 질문을 해보기 좋은 곳이지요.</p> </li>

<!--
<li><p><b>Q: </b></p>
<p>A: </p>
</li>
-->

</ul>

</div>

</body>
</html>
