<?php require("../../entete.php");?> <?php require("../../base.php");?> <?php require("../../fonctions.php");?>

<div id="corps" class="rtl" dir='rtl'>

<h2>תמיכה לא מוגבלת ובחינם להנאתך</h2>

<p>
אחד הדברים הגדולים בקהילת הקוד הפתוח (ולינוקס במיוחד), היא העובדה שזו קהילה אמיתית. משתמשים ומפתחים נמצאים שם באמת, ברשת 
,בפורומים, ברשימות דיוור, ובערוצי IRC ועוזרים למשתמשים חדשים. כולם שמחים לראות עוד ועוד אנשים עוברים ללינוקס, והם שמחים לעזור 
לחדשים במערכת החדשה.
</p>
<p>
לכן, אם יש משהו לא מובן, תוכנה שמתנהגת בדרך לא צפויה או מאפיין שאינו בנמצא- לא צריך להסס לשאול ולבקש עזרה. אם מישהו בסביבה 
(משפחה?  עמית לעבודה?) משתמש בלינוקס, הוא או היא בטח ישמחו לעזור.  אם לא, התחברו לרשת ותוכלו למצוא אלפי מקומות עם אנשים נחמדים שישיבו 
לכם ויסבירו לך כיצד להחלץ מהמבוכה: גיקים הם אנשים די נחמדים, כששואלים אותם בנימוס. פשוט גגלו "עזרה בלינוקס" או "linux help" או 
שתגלשו לאתר whatsup.org.il  <!--תוספת שלי עבור משתמשים בעברית, ניתן למחוק אם זה לא במקום. -\\- הוספה ראויה לדעתי-אורן-->

(בגיגול ניתן להחליף את המלה לינוקס בשם ההפצה המועדפת עליכם - ראו את הקטע העוסק בהתקנה), וללא ספק תמצאו את מה שאתם צריכים.
</p>

</div>
<?php require("../../license_he.php");?>
</body>
</html>
