<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Будьте эксклюзивными и альтернативными - выберите сами вид рабочего стола!.</h2>

<p>Если вы пользуетесь Windows, ваша рабочая среда врядли сильно
отличается от этого:</p>


<img src="Images/windows_vista.jpg" />

<p>Практически все пользователи Windows имеют одинаковые (или очень похожие)
рабочие столы. Вы конечно можете поменять свои обои, цвета окошек, их элементов,
... но... На этом обычно настройка интерфейса Windows заканчивается.</p>

<p>С Linux программисты возвращают возможность выбора в ваши руки! Больше
не нужно перенимать один единственный стиль работы с окнами: вы можете
выбирать из обширного списка программ, называемых "менеджеры рабочего стола / окон".
С другой стороны, если вы не любите сами что-то настраивать и менять - не беспокойтесь.
В стандартной комплектации любого дистрибутива уже идёт очень хороший менеджер окон,
но вы конечно сможете его заменить, если захотите. К каждому менеджеру окошек может
прилагаться огромное количество "скинов" ("шкурок", "визуальных стилей"), а также
свой редактор для создания вашего собственного.</p>

<p>Так что если вы людите простую, эффективную и понятную рабочую среду,
вам, вероятно, понравится это (гном):</p>

<img src="Images/ubuntu.jpg"/>

<p>Хотите более современный и "стеклянный" вид? Выбирайте этот (кде):</p>

<img src="Images/kde.png" />

<p>Вы также можете использовать очень легкую и быструю среду (xfce):</p>

<img src="Images/xfce.jpg" />

<p>Или эту, если вы хотите настроить абсолютно всё:</p>

<img src="Images/wm.jpg" />

<p>Но это далеко не полный список! Как видите, с Linux <b>вы сами выбираете</b>,
как выглядеть вашему рабочему столу. В то же время вам не нужно выбирать что-то одно: 
вы можете пользоваться всеми этими оконными менеджерами, переключаться между ними. Вы
можете даже настроить Linux так, чтобы каждый день загружалась другая среда, другая
шкурка или обоина рабочего стола. </p>

</div>
</body>
</html>
