<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html style="direction: rtl;" lang="fa">
<head>

  
  <meta content="text/html;charset=UTF-8" http-equiv="Content-Type">
<?php require("../../entete.php"); ?><?php require("../../base.php"); ?>

  
  <title></title>
</head>


<body>

<div style="font-family: Tahoma;" id="corps">

<h2>خودتون شكل ميزكارتون رو انتخاب كنيد.</h2>



<p>اگه از ويندوز استفاده ميكنيد،ميزكار شما چيزي متفاوت تر از اين نيست:</p>



<div style="text-align: center;"><img src="Images/windows_vista.jpg">

</div>

<p>همه كاربران ويندوز ميزكار يك شكلي دارند.شما مي&zwnj;تونين عكس پس
زمينه و يا رنگ اصلي ميزكار(كه بصورت پيش فرض آبيه)رو عوض كنين اما در اصل
با همون ميزكار هميشگي ويندوز سروكار دارين.</p>

با لينوكس،انتخاب با خود شماست.شما ديگه مجبور نيستيد كه اون تنها راه
مديريت پنجره&zwnj;ها رو بپذيريد بلكه ميتونين از ميان چندين
برنامه&zwnj;اي كه "مدير پنجره"ناميده ميشن يكي رو انتخاب كنيد.<br />

نگران نباشيد،شما بصورت پيش فرض يك مدير پنجره عالي دارين.نكته اينجاست كه بعداً در صورت تمايل مي&zwnj;تونين اونرو عوض كنين.<br />

<br />

اگه شما يك ميزكار ساده،كارا و آسان رو ميخواين،ممكنه اين بدردتون بخوره:

<img src="Images/ubuntu.jpg">

<p>اگر هم به يك ميزكار مدرنتر و زيباتر ميانديشيد اين يكي انتخاب خوبيه:</p>



<img src="Images/kde.png">

<p>و يا شايد اين رو انتخاب كنيد،ساده و سريع:</p>



<img src="Images/xfce.jpg">

<p>يا حتي اين يكي اگه شما واقعاً يك ميزكار متمايز وكاملاً قابل شخصي سازي لازم دارين:</p>



<img src="Images/wm.jpg">

<p>همينطور كه ميبينيد با لينوكس شما ميتونين شكل ميزكارتون رو خودتون
انتخاب كنيد و همچنين لازم نيست كه اورو يكبار براي هميشه انتخاب كنيد:شما
ميتونين موقع وردو به كامپيوتر از بين اونها يكي رو انتخاب كنيد</p>

<p><br />

</p>



</div>


</body>
</html>
