<?php require("../../entete.php"); ?> <?php require("../../base.php"); ?> <?php require("../../fonctions.php"); ?>

<div id="corps">

<h2>Обери, як буде виглядати твій екран</h2>
<p align="center">Переклад з німецької Завгородньої Тетяни</p>

<p>Якщо ти користувач Windows, то твій екран буде схожий на цей:</p>

<img src="Images/windows_vista.jpg" />

<p>Багато користувачів Windows мають однаковий екран. Звісно ти можеш змінити фон, кольори та оформлення вікна (стандартний - блакитний), але в основному у всіх користувачів Windows вигляд робочого столу типовий.</p>

<p>В Linux ти можеш сам обирати, як буде виглядати твоя робоча оболонка. У тебе є вибір серед багатьох варіантів, оскільки в Linux можна встановлювати різні Windowmanager. Всі вони по-своєму гарні.</p>

<p>Якщо тобі потрібна проста і гарна робоча оболонка, якою ефективно та легко користуватися, тобі має сподобатись це:</p>

<img src="Images/ubuntu.jpg"/>

<p>Якщо ти віддаєш перевагу сучасному «глянцевому» вигляду екрана, то можеш змінити його на цей:</p>

<img src="Images/kde.png" />

<p>	Або можеш випробувати цей, просто та швидко:</p>

<img src="Images/xfce.jpg" />

<p> Твій екран може виглядати також так, якщо ти сам його оформиш::</p>

<img src="Images/wm.jpg" />

<p>	Як ти сам можеш бачити, ти сам вирішуєш, як виглядатиме твій екран. І це рішення також не остаточне: при кожному вході в систему ти можеш змінювати свій стиль екрана, якщо звісно перед цим ти встановив більш ніж один стиль.</p>

</div>
</body>
</html>
